[Killed] StringLiteral
punyexpr.js:4:30
 (function (exports) {
   'use strict'
 
-  const TOKEN_TYPE_LITERAL = 'literal'
+  const TOKEN_TYPE_LITERAL = ""
   const TOKEN_TYPE_IDENTIFIER = 'identifier'
   const TOKEN_TYPE_REGEX = 'regex'
killedBy: expression basic "".split().length = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Array [

[Killed] StringLiteral
punyexpr.js:6:28
 
   const TOKEN_TYPE_LITERAL = 'literal'
   const TOKEN_TYPE_IDENTIFIER = 'identifier'
-  const TOKEN_TYPE_REGEX = 'regex'
+  const TOKEN_TYPE_REGEX = ""
   const TOKEN_TYPE_SYMBOL = 'symbol'
   const FUNCTION = 'function'
killedBy: tokenizer basic "/ab+c/" ⇒ [["regex",["ab+c",""],0,6]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Array [

[Killed] StringLiteral
punyexpr.js:8:20
   const TOKEN_TYPE_IDENTIFIER = 'identifier'
   const TOKEN_TYPE_REGEX = 'regex'
   const TOKEN_TYPE_SYMBOL = 'symbol'
-  const FUNCTION = 'function'
+  const FUNCTION = ""
 
   class PunyExprError extends Error {
killedBy: expression basic 1 + 2 = 3
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 16
+ Received  +  2

  Object {
    "args": Array [
-     Object {

[Killed] BlockStatement
punyexpr.js:17:52
       this.offset = offset
     }
   }
-  PunyExprError.throw = (name, message, offset) => {
-    throw new PunyExprError(name, message, offset)
-  }
+  PunyExprError.throw = (name, message, offset) => {}
 
   const tokenize = (() => {
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] Regex
punyexpr.js:26:46
 
     const TOKEN_REGEXP_SINGLE_QUOTE_STRING = /'((?:[^'\\]|\\.)*)'/
-    const TOKEN_REGEXP_DOUBLE_QUOTE_STRING = /"((?:[^"\\]|\\.)*)"/
+    const TOKEN_REGEXP_DOUBLE_QUOTE_STRING = /"((?:[^"\\]|\\.))"/
     const TOKEN_REGEXP_NUMBER = /((?:\d+(?:\.\d*)?|\.\d+))/
 
killedBy: tokenizer basic "\"a\\\"b\"" ⇒ [["literal","a\"b",0,6]]
statusReason: InvalidTokenError: Invalid token @0

[Killed] Regex
punyexpr.js:27:33
 
     const TOKEN_REGEXP_SINGLE_QUOTE_STRING = /'((?:[^'\\]|\\.)*)'/
     const TOKEN_REGEXP_DOUBLE_QUOTE_STRING = /"((?:[^"\\]|\\.)*)"/
-    const TOKEN_REGEXP_NUMBER = /((?:\d+(?:\.\d*)?|\.\d+))/
+    const TOKEN_REGEXP_NUMBER = /((?:\D+(?:\.\d*)?|\.\d+))/
 
     const TOKEN_REGEXP_IDENTIFIER = /([a-zA-Z_][a-zA-Z_0-9]*)/
killedBy: expression builds a function
statusReason: InvalidTokenError: Invalid token @0

[Killed] Regex
punyexpr.js:27:33
 
     const TOKEN_REGEXP_SINGLE_QUOTE_STRING = /'((?:[^'\\]|\\.)*)'/
     const TOKEN_REGEXP_DOUBLE_QUOTE_STRING = /"((?:[^"\\]|\\.)*)"/
-    const TOKEN_REGEXP_NUMBER = /((?:\d+(?:\.\d*)?|\.\d+))/
+    const TOKEN_REGEXP_NUMBER = /((?:\d+(?:\.\d*)?|\.\D+))/
 
     const TOKEN_REGEXP_IDENTIFIER = /([a-zA-Z_][a-zA-Z_0-9]*)/
killedBy: tokenizer basic ".123" ⇒ [["literal",0.123,0,4]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 9

  Array [
    Array [
-     "literal",

[Killed] Regex
punyexpr.js:31:32
 
     const TOKEN_REGEXP_IDENTIFIER = /([a-zA-Z_][a-zA-Z_0-9]*)/
 
-    const TOKEN_REGEXP_REGEX = /(\/(?:[^/\\]|\\.)+\/[gmiysd]*)/
+    const TOKEN_REGEXP_REGEX = /(\/(?:[^/\\]|\\.)+\/[^gmiysd]*)/
 
     const TOKEN_REGEXP_SYMBOL = /(\+|-|\*|\/|\[|\]|\.|\?|:|%|<|=|>|!|&|\||\(|\)|,)/
killedBy: tokenizer basic "/ab+c/ig" ⇒ [["regex",["ab+c","ig"],0,8]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 8

  Array [
    Array [
      "regex",

[Killed] Regex
punyexpr.js:31:32
 
     const TOKEN_REGEXP_IDENTIFIER = /([a-zA-Z_][a-zA-Z_0-9]*)/
 
-    const TOKEN_REGEXP_REGEX = /(\/(?:[^/\\]|\\.)+\/[gmiysd]*)/
+    const TOKEN_REGEXP_REGEX = /(\/(?:[/\\]|\\.)+\/[gmiysd]*)/
 
     const TOKEN_REGEXP_SYMBOL = /(\+|-|\*|\/|\[|\]|\.|\?|:|%|<|=|>|!|&|\||\(|\)|,)/
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "RegExpDisabledError"
Received: "UnexpectedTokenError"

[Killed] Regex
punyexpr.js:35:36
 
     const TOKEN_REGEXP_SYMBOL = /(\+|-|\*|\/|\[|\]|\.|\?|:|%|<|=|>|!|&|\||\(|\)|,)/
 
-    const TOKEN_REGEXP_SEPARATOR = /(\s)/
+    const TOKEN_REGEXP_SEPARATOR = /(\S)/
 
     const TOKEN_REGEXP_UNKNOWN = /(.)/
killedBy: expression builds a function
statusReason: InvalidTokenError: Invalid token @1

[Killed] MethodExpression
punyexpr.js:49:53
 
       TOKEN_REGEXP_SEPARATOR,
       TOKEN_REGEXP_UNKNOWN
-    ].map(re => { const str = re.toString(); return str.substring(1, str.length - 1) }).join('|'), 'g')
+    ].map(re => { const str = re.toString(); return str }).join('|'), 'g')
 
     const invalidTokenError = offset => PunyExprError.throw('InvalidTokenError', `Invalid token @${offset}`, offset)
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Array [
-     "literal",

[Killed] BlockStatement
punyexpr.js:49:17
 
       TOKEN_REGEXP_SEPARATOR,
       TOKEN_REGEXP_UNKNOWN
-    ].map(re => { const str = re.toString(); return str.substring(1, str.length - 1) }).join('|'), 'g')
+    ].map(re => {}).join('|'), 'g')
 
     const invalidTokenError = offset => PunyExprError.throw('InvalidTokenError', `Invalid token @${offset}`, offset)
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: TypeError: value.replace is not a function

[Killed] ArrowFunction
punyexpr.js:51:31
       TOKEN_REGEXP_UNKNOWN
     ].map(re => { const str = re.toString(); return str.substring(1, str.length - 1) }).join('|'), 'g')
 
-    const invalidTokenError = offset => PunyExprError.throw('InvalidTokenError', `Invalid token @${offset}`, offset)
+    const invalidTokenError = () => undefined
 
     const IDENTIFIER_TO_LITERAL = {
killedBy: tokenizer error "\"'" ⇒ fails @0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "InvalidTokenError"
Received: "TypeError"

[Killed] BooleanLiteral
punyexpr.js:54:13
     const invalidTokenError = offset => PunyExprError.throw('InvalidTokenError', `Invalid token @${offset}`, offset)
 
     const IDENTIFIER_TO_LITERAL = {
-      true: true,
+      true: false,
       false: false,
       undefined,
killedBy: expression basic true = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "args": Array [
-     true,

[Killed] BooleanLiteral
punyexpr.js:55:14
 
     const IDENTIFIER_TO_LITERAL = {
       true: true,
-      false: false,
+      false: true,
       undefined,
       null: null
killedBy: expression basic false && false = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,18 +1,18 @@
  Object {
    "args": Array [

[Killed] ArrayDeclaration
punyexpr.js:60:33
       null: null
     }
 
-    const TOKENIZER_CONVERTER = [
-      value => [TOKEN_TYPE_LITERAL, value.replace(/\\'/g, '\'')],
-      value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
-      value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
-      (value, offset) => {
-        if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {
-          return [TOKEN_TYPE_LITERAL, IDENTIFIER_TO_LITERAL[value]]
-        }
-        if (JS_FORBIDDEN_KEYWORDS.includes(value)) {
-          invalidTokenError(offset)
-        }
-        return [TOKEN_TYPE_IDENTIFIER, value]
-      },
-      value => {
-        const endPos = value.lastIndexOf('/')
-        const source = value.substring(1, endPos)
-        const flags = value.substring(endPos + 1)
-        return [TOKEN_TYPE_REGEX, [source, flags]]
-      },
-      value => [TOKEN_TYPE_SYMBOL, value],
-      value => [],
-      (value, offset) => invalidTokenError(offset)
-    ]
+    const TOKENIZER_CONVERTER = []
 
     return (string) => {
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] ArrowFunction
punyexpr.js:61:7
     }
 
     const TOKENIZER_CONVERTER = [
-      value => [TOKEN_TYPE_LITERAL, value.replace(/\\'/g, '\'')],
+      () => undefined,
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
       value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
killedBy: expression basic 'a' = "a"
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] ArrowFunction
punyexpr.js:62:7
 
     const TOKENIZER_CONVERTER = [
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\'/g, '\'')],
-      value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
+      () => undefined,
       value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
       (value, offset) => {
killedBy: tokenizer basic "\"a\"" ⇒ [["literal","a",0,3]]
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] ArrayDeclaration
punyexpr.js:62:16
 
     const TOKENIZER_CONVERTER = [
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\'/g, '\'')],
-      value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
+      value => [],
       value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
       (value, offset) => {
killedBy: expression basic "a" = "a"
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] ArrowFunction
punyexpr.js:63:7
     const TOKENIZER_CONVERTER = [
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\'/g, '\'')],
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
-      value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
+      () => undefined,
       (value, offset) => {
         if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {
killedBy: expression builds a function
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] ArrayDeclaration
punyexpr.js:63:16
     const TOKENIZER_CONVERTER = [
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\'/g, '\'')],
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
-      value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
+      value => [],
       (value, offset) => {
         if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Array [
-     "literal",

[Killed] BlockStatement
punyexpr.js:64:26
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\'/g, '\'')],
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
       value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
-      (value, offset) => {
-        if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {
-          return [TOKEN_TYPE_LITERAL, IDENTIFIER_TO_LITERAL[value]]
-        }
-        if (JS_FORBIDDEN_KEYWORDS.includes(value)) {
-          invalidTokenError(offset)
-        }
-        return [TOKEN_TYPE_IDENTIFIER, value]
-      },
+      (value, offset) => {},
       value => {
         const endPos = value.lastIndexOf('/')
killedBy: tokenizer basic "true" ⇒ [["literal",true,0,4]]
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] BlockStatement
punyexpr.js:65:81
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
       value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
       (value, offset) => {
-        if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {
-          return [TOKEN_TYPE_LITERAL, IDENTIFIER_TO_LITERAL[value]]
-        }
+        if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {}
         if (JS_FORBIDDEN_KEYWORDS.includes(value)) {
           invalidTokenError(offset)
killedBy: expression basic true = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 8

  Object {
    "args": Array [
-     true,

[Killed] ConditionalExpression
punyexpr.js:65:13
       value => [TOKEN_TYPE_LITERAL, value.replace(/\\"/g, '"')],
       value => [TOKEN_TYPE_LITERAL, parseFloat(value)],
       (value, offset) => {
-        if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {
+        if (false) {
           return [TOKEN_TYPE_LITERAL, IDENTIFIER_TO_LITERAL[value]]
         }
killedBy: tokenizer basic "true" ⇒ [["literal",true,0,4]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Array [
-     "literal",

[Killed] ConditionalExpression
punyexpr.js:68:13
         if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {
           return [TOKEN_TYPE_LITERAL, IDENTIFIER_TO_LITERAL[value]]
         }
-        if (JS_FORBIDDEN_KEYWORDS.includes(value)) {
+        if (false) {
           invalidTokenError(offset)
         }
killedBy: tokenizer error "if" ⇒ fails @0
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
punyexpr.js:68:13
         if (Object.prototype.hasOwnProperty.call(IDENTIFIER_TO_LITERAL, value)) {
           return [TOKEN_TYPE_LITERAL, IDENTIFIER_TO_LITERAL[value]]
         }
-        if (JS_FORBIDDEN_KEYWORDS.includes(value)) {
+        if (true) {
           invalidTokenError(offset)
         }
killedBy: tokenizer basic "a" ⇒ [["identifier","a",0,1]]
statusReason: InvalidTokenError: Invalid token @0

[Killed] ArrayDeclaration
punyexpr.js:71:16
         if (JS_FORBIDDEN_KEYWORDS.includes(value)) {
           invalidTokenError(offset)
         }
-        return [TOKEN_TYPE_IDENTIFIER, value]
+        return []
       },
       value => {
killedBy: tokenizer basic "a" ⇒ [["identifier","a",0,1]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Array [
-     "identifier",

[Killed] BlockStatement
punyexpr.js:73:16
         }
         return [TOKEN_TYPE_IDENTIFIER, value]
       },
-      value => {
-        const endPos = value.lastIndexOf('/')
-        const source = value.substring(1, endPos)
-        const flags = value.substring(endPos + 1)
-        return [TOKEN_TYPE_REGEX, [source, flags]]
-      },
+      value => {},
       value => [TOKEN_TYPE_SYMBOL, value],
       value => [],
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "RegExpDisabledError"
Received: "TypeError"

[Killed] MethodExpression
punyexpr.js:75:24
       },
       value => {
         const endPos = value.lastIndexOf('/')
-        const source = value.substring(1, endPos)
+        const source = value
         const flags = value.substring(endPos + 1)
         return [TOKEN_TYPE_REGEX, [source, flags]]
killedBy: tokenizer basic "/ab+c/" ⇒ [["regex",["ab+c",""],0,6]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,10 +1,10 @@
  Array [
    Array [

[Killed] ArithmeticOperator
punyexpr.js:76:39
       value => {
         const endPos = value.lastIndexOf('/')
         const source = value.substring(1, endPos)
-        const flags = value.substring(endPos + 1)
+        const flags = value.substring(endPos - 1)
         return [TOKEN_TYPE_REGEX, [source, flags]]
       },
killedBy: tokenizer basic "/ab+c/" ⇒ [["regex",["ab+c",""],0,6]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
      "regex",

[Killed] MethodExpression
punyexpr.js:76:23
       value => {
         const endPos = value.lastIndexOf('/')
         const source = value.substring(1, endPos)
-        const flags = value.substring(endPos + 1)
+        const flags = value
         return [TOKEN_TYPE_REGEX, [source, flags]]
       },
killedBy: tokenizer basic "/ab+c/" ⇒ [["regex",["ab+c",""],0,6]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
      "regex",

[Killed] ArrowFunction
punyexpr.js:79:7
         const flags = value.substring(endPos + 1)
         return [TOKEN_TYPE_REGEX, [source, flags]]
       },
-      value => [TOKEN_TYPE_SYMBOL, value],
+      () => undefined,
       value => [],
       (value, offset) => invalidTokenError(offset)
killedBy: expression builds a function
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] ArrayDeclaration
punyexpr.js:79:16
         const flags = value.substring(endPos + 1)
         return [TOKEN_TYPE_REGEX, [source, flags]]
       },
-      value => [TOKEN_TYPE_SYMBOL, value],
+      value => [],
       value => [],
       (value, offset) => invalidTokenError(offset)
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @4

[Killed] ArrowFunction
punyexpr.js:80:7
         return [TOKEN_TYPE_REGEX, [source, flags]]
       },
       value => [TOKEN_TYPE_SYMBOL, value],
-      value => [],
+      () => undefined,
       (value, offset) => invalidTokenError(offset)
     ]
killedBy: expression builds a function
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] ArrowFunction
punyexpr.js:81:7
       },
       value => [TOKEN_TYPE_SYMBOL, value],
       value => [],
-      (value, offset) => invalidTokenError(offset)
+      () => undefined
     ]
 
killedBy: tokenizer error "\"'" ⇒ fails @0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "InvalidTokenError"
Received: "TypeError"

[Killed] BlockStatement
punyexpr.js:84:24
       (value, offset) => invalidTokenError(offset)
     ]
 
-    return (string) => {
-      const tokens = []
-      let offset = 0
-      let lastTokenType
-      const requireSeparator = [TOKEN_TYPE_LITERAL, TOKEN_TYPE_IDENTIFIER]
-      string.replace(TOKENIZER_REGEXP, ({ length }, ...capturedValues) => {
-        const rawType = capturedValues.findIndex(capturedValue => capturedValue !== undefined)
-        const capturedValue = capturedValues[rawType]
-        const converter = TOKENIZER_CONVERTER[rawType]
-        const [type, value] = converter(capturedValue, offset)
-        if (requireSeparator.includes(type) && requireSeparator.includes(lastTokenType)) {
-          invalidTokenError(offset)
-        }
-        lastTokenType = type
-        if (type !== undefined) {
-          tokens.push([type, value, offset, length])
-        }
-        offset += length
-      })
-      return tokens
-    }
+    return (string) => {}
   })()
 
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [["literal", 1, 0, 1]]
Received: undefined

[Killed] BlockStatement
punyexpr.js:89:75
       let offset = 0
       let lastTokenType
       const requireSeparator = [TOKEN_TYPE_LITERAL, TOKEN_TYPE_IDENTIFIER]
-      string.replace(TOKENIZER_REGEXP, ({ length }, ...capturedValues) => {
-        const rawType = capturedValues.findIndex(capturedValue => capturedValue !== undefined)
-        const capturedValue = capturedValues[rawType]
-        const converter = TOKENIZER_CONVERTER[rawType]
-        const [type, value] = converter(capturedValue, offset)
-        if (requireSeparator.includes(type) && requireSeparator.includes(lastTokenType)) {
-          invalidTokenError(offset)
-        }
-        lastTokenType = type
-        if (type !== undefined) {
-          tokens.push([type, value, offset, length])
-        }
-        offset += length
-      })
+      string.replace(TOKENIZER_REGEXP, ({ length }, ...capturedValues) => {})
       return tokens
     }
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Array [
-     "literal",

[Killed] ConditionalExpression
punyexpr.js:90:67
       let lastTokenType
       const requireSeparator = [TOKEN_TYPE_LITERAL, TOKEN_TYPE_IDENTIFIER]
       string.replace(TOKENIZER_REGEXP, ({ length }, ...capturedValues) => {
-        const rawType = capturedValues.findIndex(capturedValue => capturedValue !== undefined)
+        const rawType = capturedValues.findIndex(capturedValue => false)
         const capturedValue = capturedValues[rawType]
         const converter = TOKENIZER_CONVERTER[rawType]
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] ArrowFunction
punyexpr.js:90:50
       let lastTokenType
       const requireSeparator = [TOKEN_TYPE_LITERAL, TOKEN_TYPE_IDENTIFIER]
       string.replace(TOKENIZER_REGEXP, ({ length }, ...capturedValues) => {
-        const rawType = capturedValues.findIndex(capturedValue => capturedValue !== undefined)
+        const rawType = capturedValues.findIndex(() => undefined)
         const capturedValue = capturedValues[rawType]
         const converter = TOKENIZER_CONVERTER[rawType]
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: TypeError: converter is not a function or its return value is not iterable

[Killed] LogicalOperator
punyexpr.js:94:13
         const capturedValue = capturedValues[rawType]
         const converter = TOKENIZER_CONVERTER[rawType]
         const [type, value] = converter(capturedValue, offset)
-        if (requireSeparator.includes(type) && requireSeparator.includes(lastTokenType)) {
+        if (requireSeparator.includes(type) || requireSeparator.includes(lastTokenType)) {
           invalidTokenError(offset)
         }
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: InvalidTokenError: Invalid token @0

[Killed] ConditionalExpression
punyexpr.js:94:13
         const capturedValue = capturedValues[rawType]
         const converter = TOKENIZER_CONVERTER[rawType]
         const [type, value] = converter(capturedValue, offset)
-        if (requireSeparator.includes(type) && requireSeparator.includes(lastTokenType)) {
+        if (true) {
           invalidTokenError(offset)
         }
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: InvalidTokenError: Invalid token @0

[Killed] ConditionalExpression
punyexpr.js:98:13
           invalidTokenError(offset)
         }
         lastTokenType = type
-        if (type !== undefined) {
+        if (false) {
           tokens.push([type, value, offset, length])
         }
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] EqualityOperator
punyexpr.js:98:13
           invalidTokenError(offset)
         }
         lastTokenType = type
-        if (type !== undefined) {
+        if (type === undefined) {
           tokens.push([type, value, offset, length])
         }
killedBy: tokenizer basic "1" ⇒ [["literal",1,0,1]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Array [
-     "literal",

[Killed] AssignmentOperator
punyexpr.js:101:9
         if (type !== undefined) {
           tokens.push([type, value, offset, length])
         }
-        offset += length
+        offset -= length
       })
       return tokens
killedBy: tokenizer combining "1+1" ⇒ [["literal",1,0,1],["symbol","+",1,1],["literal",1,2,1]]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -6,15 +6,15 @@
      1,
    ],

[Killed] ArrowFunction
punyexpr.js:199:37
   Expression :
     ConditionalExpression
 */
-    const buildOp = (name, impl) => (range, ...args) => Object.assign(impl.bind(null, ...args), { $: [name, args, range] })
+    const buildOp = (name, impl) => () => undefined
 
     const constant = buildOp('constant', value => value)
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] ArrowFunction
punyexpr.js:199:21
   Expression :
     ConditionalExpression
 */
-    const buildOp = (name, impl) => (range, ...args) => Object.assign(impl.bind(null, ...args), { $: [name, args, range] })
+    const buildOp = () => undefined
 
     const constant = buildOp('constant', value => value)
killedBy: expression builds a function
statusReason: TypeError: constant is not a function

[Killed] ArrowFunction
punyexpr.js:201:42
 */
     const buildOp = (name, impl) => (range, ...args) => Object.assign(impl.bind(null, ...args), { $: [name, args, range] })
 
-    const constant = buildOp('constant', value => value)
+    const constant = buildOp('constant', () => undefined)
     const array = buildOp('array', (...itemsAndContext) => {
       const context = itemsAndContext[itemsAndContext.length - 1]
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] StringLiteral
punyexpr.js:201:30
 */
     const buildOp = (name, impl) => (range, ...args) => Object.assign(impl.bind(null, ...args), { $: [name, args, range] })
 
-    const constant = buildOp('constant', value => value)
+    const constant = buildOp("", value => value)
     const array = buildOp('array', (...itemsAndContext) => {
       const context = itemsAndContext[itemsAndContext.length - 1]
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "args": Array [
      1,

[Killed] BlockStatement
punyexpr.js:202:60
     const buildOp = (name, impl) => (range, ...args) => Object.assign(impl.bind(null, ...args), { $: [name, args, range] })
 
     const constant = buildOp('constant', value => value)
-    const array = buildOp('array', (...itemsAndContext) => {
-      const context = itemsAndContext[itemsAndContext.length - 1]
-      return itemsAndContext.slice(0, -1).map(item => item(context))
-    })
+    const array = buildOp('array', (...itemsAndContext) => {})
     const regex = buildOp('regex', (source, flags) => new RegExp(source, flags))
     const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
killedBy: expression array [] = []
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArithmeticOperator
punyexpr.js:203:39
 
     const constant = buildOp('constant', value => value)
     const array = buildOp('array', (...itemsAndContext) => {
-      const context = itemsAndContext[itemsAndContext.length - 1]
+      const context = itemsAndContext[itemsAndContext.length + 1]
       return itemsAndContext.slice(0, -1).map(item => item(context))
     })
killedBy: expression contextual [1, hello] = [1,"World !"]
statusReason: TypeError: Cannot read properties of undefined (reading 'hello')

[Killed] MethodExpression
punyexpr.js:204:14
     const constant = buildOp('constant', value => value)
     const array = buildOp('array', (...itemsAndContext) => {
       const context = itemsAndContext[itemsAndContext.length - 1]
-      return itemsAndContext.slice(0, -1).map(item => item(context))
+      return itemsAndContext.map(item => item(context))
     })
     const regex = buildOp('regex', (source, flags) => new RegExp(source, flags))
killedBy: expression array [] = []
statusReason: TypeError: item is not a function

[Killed] UnaryOperator
punyexpr.js:204:39
     const constant = buildOp('constant', value => value)
     const array = buildOp('array', (...itemsAndContext) => {
       const context = itemsAndContext[itemsAndContext.length - 1]
-      return itemsAndContext.slice(0, -1).map(item => item(context))
+      return itemsAndContext.slice(0, +1).map(item => item(context))
     })
     const regex = buildOp('regex', (source, flags) => new RegExp(source, flags))
killedBy: expression array [] = []
statusReason: TypeError: item is not a function

[Killed] ArrowFunction
punyexpr.js:206:36
       const context = itemsAndContext[itemsAndContext.length - 1]
       return itemsAndContext.slice(0, -1).map(item => item(context))
     })
-    const regex = buildOp('regex', (source, flags) => new RegExp(source, flags))
+    const regex = buildOp('regex', () => undefined)
     const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
     const propertyOf = buildOp('property', (object, name, context) => {
killedBy: expression regex when allowed /abc/ = {}
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: /abc/
Received: undefined

[Killed] ArrowFunction
punyexpr.js:207:50
       return itemsAndContext.slice(0, -1).map(item => item(context))
     })
     const regex = buildOp('regex', (source, flags) => new RegExp(source, flags))
-    const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
+    const propertyOfContext = buildOp('context', () => undefined)
     const propertyOf = buildOp('property', (object, name, context) => {
       const that = object(context)
killedBy: expression contextual hello = "World !"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "World !"
Received: undefined
