[Killed] BlockStatement
punyexpr.js:208:71
     })
     const regex = buildOp('regex', (source, flags) => new RegExp(source, flags))
     const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
-    const propertyOf = buildOp('property', (object, name, context) => {
-      const that = object(context)
-      const result = that[name(context)]
-      // eslint-disable-next-line valid-typeof
-      if (typeof result === FUNCTION) {
-        return result.bind(that)
-      }
-      return result
-    })
+    const propertyOf = buildOp('property', (object, name, context) => {})
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
     const neg = buildOp('neg', (value, context) => -value(context))
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: TypeError: Cannot read properties of undefined (reading 'apply')

[Killed] EqualityOperator
punyexpr.js:212:11
       const that = object(context)
       const result = that[name(context)]
       // eslint-disable-next-line valid-typeof
-      if (typeof result === FUNCTION) {
+      if (typeof result !== FUNCTION) {
         return result.bind(that)
       }
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: TypeError: Number.prototype.toFixed requires that 'this' be a Number

[Killed] BlockStatement
punyexpr.js:212:39
       const that = object(context)
       const result = that[name(context)]
       // eslint-disable-next-line valid-typeof
-      if (typeof result === FUNCTION) {
-        return result.bind(that)
-      }
+      if (typeof result === FUNCTION) {}
       return result
     })
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: TypeError: Number.prototype.toFixed requires that 'this' be a Number

[Killed] ArrowFunction
punyexpr.js:217:102
       }
       return result
     })
-    const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
+    const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(() => undefined)))
     const neg = buildOp('neg', (value, context) => -value(context))
     const not = buildOp('not', (value, context) => !value(context))
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "2.00"
Received: "2"

[Killed] ArrowFunction
punyexpr.js:217:42
       }
       return result
     })
-    const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
+    const callFunction = buildOp('call', () => undefined)
     const neg = buildOp('neg', (value, context) => -value(context))
     const not = buildOp('not', (value, context) => !value(context))
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "2.00"
Received: undefined

[Killed] ArrowFunction
punyexpr.js:218:32
       return result
     })
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
-    const neg = buildOp('neg', (value, context) => -value(context))
+    const neg = buildOp('neg', () => undefined)
     const not = buildOp('not', (value, context) => !value(context))
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
killedBy: expression basic -1 = -1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: -1
Received: undefined

[Killed] UnaryOperator
punyexpr.js:218:52
       return result
     })
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
-    const neg = buildOp('neg', (value, context) => -value(context))
+    const neg = buildOp('neg', (value, context) => +value(context))
     const not = buildOp('not', (value, context) => !value(context))
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
killedBy: expression basic -1 = -1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: -1
Received: 1

[Killed] BooleanLiteral
punyexpr.js:219:52
     })
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
     const neg = buildOp('neg', (value, context) => -value(context))
-    const not = buildOp('not', (value, context) => !value(context))
+    const not = buildOp('not', (value, context) => value(context))
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
killedBy: expression basic !true = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ArrowFunction
punyexpr.js:219:32
     })
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
     const neg = buildOp('neg', (value, context) => -value(context))
-    const not = buildOp('not', (value, context) => !value(context))
+    const not = buildOp('not', () => undefined)
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
killedBy: expression basic !true = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] ArrowFunction
punyexpr.js:220:44
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
     const neg = buildOp('neg', (value, context) => -value(context))
     const not = buildOp('not', (value, context) => !value(context))
-    const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
+    const getTypeof = buildOp('getTypeof', () => undefined)
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
     const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
killedBy: expression basic typeof 1 = "number"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "number"
Received: undefined

[Killed] ArrowFunction
punyexpr.js:221:32
     const neg = buildOp('neg', (value, context) => -value(context))
     const not = buildOp('not', (value, context) => !value(context))
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
-    const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
+    const exp = buildOp('exp', () => undefined)
     const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
killedBy: expression basic 10 ** 2 = 100
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 100
Received: undefined

[Killed] ArrowFunction
punyexpr.js:222:32
     const not = buildOp('not', (value, context) => !value(context))
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
-    const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
+    const mul = buildOp('mul', () => undefined)
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
killedBy: expression basic 2 * 3 = 6
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 6
Received: undefined

[Killed] ArithmeticOperator
punyexpr.js:222:61
     const not = buildOp('not', (value, context) => !value(context))
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
-    const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
+    const mul = buildOp('mul', (value1, value2, context) => value1(context) / value2(context))
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
killedBy: expression basic 2 * 3 = 6
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 6
Received: 0.6666666666666666

[Killed] ArithmeticOperator
punyexpr.js:223:61
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
     const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
-    const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
+    const div = buildOp('div', (value1, value2, context) => value1(context) * value2(context))
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
killedBy: expression basic 3 / 2 = 1.5
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1.5
Received: 6

[Killed] ArrowFunction
punyexpr.js:223:32
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
     const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
-    const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
+    const div = buildOp('div', () => undefined)
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
killedBy: expression basic 3 / 2 = 1.5
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1.5
Received: undefined

[Killed] ArrowFunction
punyexpr.js:224:44
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
     const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
-    const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
+    const remainder = buildOp('remainder', () => undefined)
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
killedBy: expression basic 3 % 2 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
punyexpr.js:224:73
     const exp = buildOp('exp', (value1, value2, context) => value1(context) ** value2(context))
     const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
-    const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
+    const remainder = buildOp('remainder', (value1, value2, context) => value1(context) * value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
killedBy: expression basic 3 % 2 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 6

[Killed] ArrowFunction
punyexpr.js:225:32
     const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
-    const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
+    const add = buildOp('add', () => undefined)
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
killedBy: expression basic 1 + 2 = 3
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
punyexpr.js:225:61
     const mul = buildOp('mul', (value1, value2, context) => value1(context) * value2(context))
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
-    const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
+    const add = buildOp('add', (value1, value2, context) => value1(context) - value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
killedBy: expression basic 1 + 2 = 3
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: -1

[Killed] ArrowFunction
punyexpr.js:226:32
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
-    const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
+    const sub = buildOp('sub', () => undefined)
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
killedBy: expression basic 1 - 2 = -1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: -1
Received: undefined

[Killed] ArithmeticOperator
punyexpr.js:226:61
     const div = buildOp('div', (value1, value2, context) => value1(context) / value2(context))
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
-    const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
+    const sub = buildOp('sub', (value1, value2, context) => value1(context) + value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
killedBy: expression basic 1 - 2 = -1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: -1
Received: 3

[Killed] ConditionalExpression
punyexpr.js:227:59
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
-    const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
+    const lt = buildOp('lt', (value1, value2, context) => false)
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
killedBy: expression basic 1 < 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:227:59
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
-    const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
+    const lt = buildOp('lt', (value1, value2, context) => true)
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
killedBy: expression basic 2 < 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] EqualityOperator
punyexpr.js:228:59
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
-    const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
+    const gt = buildOp('gt', (value1, value2, context) => value1(context) >= value2(context))
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
killedBy: expression basic 2 > 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
punyexpr.js:228:59
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
-    const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
+    const gt = buildOp('gt', (value1, value2, context) => true)
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
killedBy: expression basic 2 > 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
punyexpr.js:229:61
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
-    const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
+    const lte = buildOp('lte', (value1, value2, context) => true)
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
     // eslint-disable-next-line eqeqeq
killedBy: expression basic 2 <= 1 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] EqualityOperator
punyexpr.js:229:61
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
-    const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
+    const lte = buildOp('lte', (value1, value2, context) => value1(context) < value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
     // eslint-disable-next-line eqeqeq
killedBy: expression basic 2 <= 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:230:61
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
-    const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
+    const gte = buildOp('gte', (value1, value2, context) => false)
     // eslint-disable-next-line eqeqeq
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
killedBy: expression basic 2 >= 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:230:61
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
-    const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
+    const gte = buildOp('gte', (value1, value2, context) => true)
     // eslint-disable-next-line eqeqeq
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
killedBy: expression basic 1 >= 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] EqualityOperator
punyexpr.js:232:59
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
     // eslint-disable-next-line eqeqeq
-    const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
+    const eq = buildOp('eq', (value1, value2, context) => value1(context) != value2(context))
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
killedBy: expression basic 1 == 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ArrowFunction
punyexpr.js:232:30
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
     // eslint-disable-next-line eqeqeq
-    const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
+    const eq = buildOp('eq', () => undefined)
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
killedBy: expression basic 1 == 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] ArrowFunction
punyexpr.js:234:32
     // eslint-disable-next-line eqeqeq
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
     // eslint-disable-next-line eqeqeq
-    const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
+    const neq = buildOp('neq', () => undefined)
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
killedBy: expression basic 1 != 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
punyexpr.js:234:61
     // eslint-disable-next-line eqeqeq
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
     // eslint-disable-next-line eqeqeq
-    const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
+    const neq = buildOp('neq', (value1, value2, context) => false)
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
killedBy: expression basic 1 != 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:235:61
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
-    const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
+    const eqq = buildOp('eqq', (value1, value2, context) => true)
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
killedBy: expression basic 1 === 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] EqualityOperator
punyexpr.js:235:61
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
-    const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
+    const eqq = buildOp('eqq', (value1, value2, context) => value1(context) !== value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
killedBy: expression basic 1 === 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
punyexpr.js:236:63
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
-    const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
+    const neqq = buildOp('neqq', (value1, value2, context) => true)
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
killedBy: expression basic 2 !== 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
punyexpr.js:236:63
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
-    const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
+    const neqq = buildOp('neqq', (value1, value2, context) => false)
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
killedBy: expression basic 1 !== 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:237:61
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
-    const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
+    const and = buildOp('and', (value1, value2, context) => true)
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
     const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
killedBy: expression basic false && false = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true
