[Killed] ArrowFunction
punyexpr.js:237:32
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
-    const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
+    const and = buildOp('and', () => undefined)
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
     const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
killedBy: expression basic false && false = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] ArrowFunction
punyexpr.js:238:30
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
-    const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
+    const or = buildOp('or', () => undefined)
     const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
       if (condition(context)) {
killedBy: expression basic false || false = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
punyexpr.js:238:59
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
-    const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
+    const or = buildOp('or', (value1, value2, context) => false)
     const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
       if (condition(context)) {
killedBy: expression basic true || false = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
punyexpr.js:239:87
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
-    const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
-      if (condition(context)) {
-        return trueValue(context)
-      }
-      return falseValue(context)
-    })
+    const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {})
 
     let tokens
killedBy: expression ternary true ? 1 : 2 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
punyexpr.js:240:11
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
     const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
-      if (condition(context)) {
+      if (true) {
         return trueValue(context)
       }
killedBy: expression ternary false ? "a" : "b" = "b"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "b"
Received: "a"

[Killed] ConditionalExpression
punyexpr.js:240:11
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
     const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
-      if (condition(context)) {
+      if (false) {
         return trueValue(context)
       }
killedBy: expression ternary true ? 1 : 2 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] BlockStatement
punyexpr.js:249:43
     let tokens
     let options
 
-    const checkNotEndOfExpression = () => {
-      if (tokens.length === 0) {
-        PunyExprError.throw('EndOfExpressionError', 'Unexpected end of expression')
-      }
-    }
+    const checkNotEndOfExpression = () => {}
     const current = () => {
       checkNotEndOfExpression()
killedBy: expression error + = EndOfExpressionError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "EndOfExpressionError"
Received: "TypeError"

[Killed] ConditionalExpression
punyexpr.js:250:11
     let options
 
     const checkNotEndOfExpression = () => {
-      if (tokens.length === 0) {
+      if (true) {
         PunyExprError.throw('EndOfExpressionError', 'Unexpected end of expression')
       }
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] EqualityOperator
punyexpr.js:250:11
     let options
 
     const checkNotEndOfExpression = () => {
-      if (tokens.length === 0) {
+      if (tokens.length !== 0) {
         PunyExprError.throw('EndOfExpressionError', 'Unexpected end of expression')
       }
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] BlockStatement
punyexpr.js:254:27
         PunyExprError.throw('EndOfExpressionError', 'Unexpected end of expression')
       }
     }
-    const current = () => {
-      checkNotEndOfExpression()
-      return tokens[0]
-    }
+    const current = () => {}
     const offset = () => current()[2]
     const range = (from, op) => {
killedBy: expression builds a function
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] ArrowFunction
punyexpr.js:258:20
       checkNotEndOfExpression()
       return tokens[0]
     }
-    const offset = () => current()[2]
+    const offset = () => undefined
     const range = (from, op) => {
       let currentRange
killedBy: expression basic 1 + 2 = 3
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -15,9 +15,9 @@
        "at": 4,
        "length": 1,

[Killed] BlockStatement
punyexpr.js:259:33
       return tokens[0]
     }
     const offset = () => current()[2]
-    const range = (from, op) => {
-      let currentRange
-      if (op) {
-        currentRange = op.$[2]
-      } else {
-        currentRange = current().splice(2)
-      }
-      const [offset, length] = currentRange
-      return [from, offset + length - from]
-    }
+    const range = (from, op) => {}
     const shift = (steps = 1) => tokens.splice(0, steps)
     const isSymbol = (expected = undefined) => {
killedBy: expression basic 1 + 2 = 3
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
punyexpr.js:261:11
     const offset = () => current()[2]
     const range = (from, op) => {
       let currentRange
-      if (op) {
+      if (true) {
         currentRange = op.$[2]
       } else {
killedBy: expression basic typeof 1 = "number"
statusReason: TypeError: Cannot read properties of undefined (reading '$')

[Killed] BlockStatement
punyexpr.js:261:15
     const offset = () => current()[2]
     const range = (from, op) => {
       let currentRange
-      if (op) {
-        currentRange = op.$[2]
-      } else {
+      if (op) {} else {
         currentRange = current().splice(2)
       }
killedBy: expression builds a function
statusReason: TypeError: currentRange is not iterable

[Killed] BlockStatement
punyexpr.js:263:14
       let currentRange
       if (op) {
         currentRange = op.$[2]
-      } else {
-        currentRange = current().splice(2)
-      }
+      } else {}
       const [offset, length] = currentRange
       return [from, offset + length - from]
killedBy: expression basic typeof 1 = "number"
statusReason: TypeError: currentRange is not iterable

[Killed] ArithmeticOperator
punyexpr.js:267:21
         currentRange = current().splice(2)
       }
       const [offset, length] = currentRange
-      return [from, offset + length - from]
+      return [from, offset - length - from]
     }
     const shift = (steps = 1) => tokens.splice(0, steps)
killedBy: expression basic 1 + 2 = 3
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -16,8 +16,8 @@
        "length": 1,
        "op": "constant",

[Killed] ArithmeticOperator
punyexpr.js:267:21
         currentRange = current().splice(2)
       }
       const [offset, length] = currentRange
-      return [from, offset + length - from]
+      return [from, offset + length + from]
     }
     const shift = (steps = 1) => tokens.splice(0, steps)
killedBy: expression basic (1 + 2) * 3 = 9
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -18,11 +18,11 @@
            "length": 1,
            "op": "constant",

[Killed] ArrowFunction
punyexpr.js:269:19
       const [offset, length] = currentRange
       return [from, offset + length - from]
     }
-    const shift = (steps = 1) => tokens.splice(0, steps)
+    const shift = () => undefined
     const isSymbol = (expected = undefined) => {
       if (tokens.length === 0) {
killedBy: expression builds a function
statusReason: TypeError: shift is not a function or its return value is not iterable

[Killed] BlockStatement
punyexpr.js:270:48
       return [from, offset + length - from]
     }
     const shift = (steps = 1) => tokens.splice(0, steps)
-    const isSymbol = (expected = undefined) => {
-      if (tokens.length === 0) {
-        return false
-      }
-      const [type, value] = tokens[0]
-      return (type === TOKEN_TYPE_SYMBOL) && (!expected || expected.includes(value))
-    }
+    const isSymbol = (expected = undefined) => {}
     const shiftOnSymbols = (expected) => {
       const nextSymbols = []
killedBy: expression basic (1 + 2) * 3 = 9
statusReason: UnexpectedRemainderError: Unexpected left over tokens @1

[Killed] ConditionalExpression
punyexpr.js:271:11
     }
     const shift = (steps = 1) => tokens.splice(0, steps)
     const isSymbol = (expected = undefined) => {
-      if (tokens.length === 0) {
+      if (true) {
         return false
       }
killedBy: expression basic (1 + 2) * 3 = 9
statusReason: UnexpectedRemainderError: Unexpected left over tokens @1

[Killed] BlockStatement
punyexpr.js:271:32
     }
     const shift = (steps = 1) => tokens.splice(0, steps)
     const isSymbol = (expected = undefined) => {
-      if (tokens.length === 0) {
-        return false
-      }
+      if (tokens.length === 0) {}
       const [type, value] = tokens[0]
       return (type === TOKEN_TYPE_SYMBOL) && (!expected || expected.includes(value))
killedBy: expression builds a function
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
punyexpr.js:272:16
     const shift = (steps = 1) => tokens.splice(0, steps)
     const isSymbol = (expected = undefined) => {
       if (tokens.length === 0) {
-        return false
+        return true
       }
       const [type, value] = tokens[0]
killedBy: expression builds a function
statusReason: TypeError: shift is not a function or its return value is not iterable

[Killed] LogicalOperator
punyexpr.js:275:14
         return false
       }
       const [type, value] = tokens[0]
-      return (type === TOKEN_TYPE_SYMBOL) && (!expected || expected.includes(value))
+      return type === TOKEN_TYPE_SYMBOL || !expected || expected.includes(value)
     }
     const shiftOnSymbols = (expected) => {
killedBy: expression builds a function
statusReason: UnexpectedTokenError: Unexpected token @0

[Killed] EqualityOperator
punyexpr.js:275:15
         return false
       }
       const [type, value] = tokens[0]
-      return (type === TOKEN_TYPE_SYMBOL) && (!expected || expected.includes(value))
+      return (type !== TOKEN_TYPE_SYMBOL) && (!expected || expected.includes(value))
     }
     const shiftOnSymbols = (expected) => {
killedBy: expression builds a function
statusReason: UnexpectedTokenError: Unexpected token @0

[Killed] BlockStatement
punyexpr.js:277:42
       const [type, value] = tokens[0]
       return (type === TOKEN_TYPE_SYMBOL) && (!expected || expected.includes(value))
     }
-    const shiftOnSymbols = (expected) => {
-      const nextSymbols = []
-      for (const token of tokens) {
-        const [type, value] = token
-        if (type !== TOKEN_TYPE_SYMBOL) {
-          break
-        }
-        nextSymbols.push(value)
-      }
-      const nextSymbolsAggregated = nextSymbols.join('')
-      const matching = expected
-        .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
-        .sort((a, b) => b.length - a.length)[0]
-      if (matching) {
-        shift(matching.length)
-        return matching
-      }
-      return false
-    }
+    const shiftOnSymbols = (expected) => {}
     const unexpected = () => PunyExprError.throw('UnexpectedTokenError', `Unexpected token @${offset(tokens)}`, offset(tokens))
 
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] BlockStatement
punyexpr.js:279:35
     }
     const shiftOnSymbols = (expected) => {
       const nextSymbols = []
-      for (const token of tokens) {
-        const [type, value] = token
-        if (type !== TOKEN_TYPE_SYMBOL) {
-          break
-        }
-        nextSymbols.push(value)
-      }
+      for (const token of tokens) {}
       const nextSymbolsAggregated = nextSymbols.join('')
       const matching = expected
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] BlockStatement
punyexpr.js:281:41
       const nextSymbols = []
       for (const token of tokens) {
         const [type, value] = token
-        if (type !== TOKEN_TYPE_SYMBOL) {
-          break
-        }
+        if (type !== TOKEN_TYPE_SYMBOL) {}
         nextSymbols.push(value)
       }
killedBy: expression error 1 | "|" = UnexpectedRemainderError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "UnexpectedRemainderError"
Received: "EndOfExpressionError"

[Killed] ConditionalExpression
punyexpr.js:281:13
       const nextSymbols = []
       for (const token of tokens) {
         const [type, value] = token
-        if (type !== TOKEN_TYPE_SYMBOL) {
+        if (true) {
           break
         }
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] StringLiteral
punyexpr.js:286:54
         }
         nextSymbols.push(value)
       }
-      const nextSymbolsAggregated = nextSymbols.join('')
+      const nextSymbolsAggregated = nextSymbols.join("Stryker was here!")
       const matching = expected
         .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
killedBy: expression basic 10 ** 2 = 100
statusReason: UnexpectedTokenError: Unexpected token @4

[Killed] MethodExpression
punyexpr.js:287:24
         nextSymbols.push(value)
       }
       const nextSymbolsAggregated = nextSymbols.join('')
-      const matching = expected
-        .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
+      const matching = expected
         .sort((a, b) => b.length - a.length)[0]
       if (matching) {
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] MethodExpression
punyexpr.js:287:24
         nextSymbols.push(value)
       }
       const nextSymbolsAggregated = nextSymbols.join('')
-      const matching = expected
-        .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
-        .sort((a, b) => b.length - a.length)[0]
+      const matching = expected.filter(symbol => nextSymbolsAggregated.startsWith(symbol))[0]
       if (matching) {
         shift(matching.length)
killedBy: expression basic 2 <= 2 = true
statusReason: UnexpectedTokenError: Unexpected token @3

[Killed] ArrowFunction
punyexpr.js:288:17
       }
       const nextSymbolsAggregated = nextSymbols.join('')
       const matching = expected
-        .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
+        .filter(() => undefined)
         .sort((a, b) => b.length - a.length)[0]
       if (matching) {
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] MethodExpression
punyexpr.js:288:27
       }
       const nextSymbolsAggregated = nextSymbols.join('')
       const matching = expected
-        .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
+        .filter(symbol => nextSymbolsAggregated.endsWith(symbol))
         .sort((a, b) => b.length - a.length)[0]
       if (matching) {
killedBy: expression basic (1 + 2) * 3 = 9
statusReason: UnexpectedTokenError: Unexpected token @8

[Killed] ArrowFunction
punyexpr.js:289:15
       const nextSymbolsAggregated = nextSymbols.join('')
       const matching = expected
         .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
-        .sort((a, b) => b.length - a.length)[0]
+        .sort(() => undefined)[0]
       if (matching) {
         shift(matching.length)
killedBy: expression basic 2 <= 2 = true
statusReason: UnexpectedTokenError: Unexpected token @3

[Killed] ArithmeticOperator
punyexpr.js:289:25
       const nextSymbolsAggregated = nextSymbols.join('')
       const matching = expected
         .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
-        .sort((a, b) => b.length - a.length)[0]
+        .sort((a, b) => b.length + a.length)[0]
       if (matching) {
         shift(matching.length)
killedBy: expression basic 2 <= 2 = true
statusReason: UnexpectedTokenError: Unexpected token @3

[Killed] ConditionalExpression
punyexpr.js:290:11
       const matching = expected
         .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
         .sort((a, b) => b.length - a.length)[0]
-      if (matching) {
+      if (false) {
         shift(matching.length)
         return matching
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] ConditionalExpression
punyexpr.js:290:11
       const matching = expected
         .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
         .sort((a, b) => b.length - a.length)[0]
-      if (matching) {
+      if (true) {
         shift(matching.length)
         return matching
killedBy: expression builds a function
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
punyexpr.js:296:24
       }
       return false
     }
-    const unexpected = () => PunyExprError.throw('UnexpectedTokenError', `Unexpected token @${offset(tokens)}`, offset(tokens))
+    const unexpected = () => undefined
 
     const arrayLiteral = () => {
killedBy: expression error * = UnexpectedTokenError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] StringLiteral
punyexpr.js:296:74
       }
       return false
     }
-    const unexpected = () => PunyExprError.throw('UnexpectedTokenError', `Unexpected token @${offset(tokens)}`, offset(tokens))
+    const unexpected = () => PunyExprError.throw('UnexpectedTokenError', ``, offset(tokens))
 
     const arrayLiteral = () => {
killedBy: expression error * = UnexpectedTokenError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "Unexpected token @0"
Received: ""

[Killed] BlockStatement
punyexpr.js:298:32
     }
     const unexpected = () => PunyExprError.throw('UnexpectedTokenError', `Unexpected token @${offset(tokens)}`, offset(tokens))
 
-    const arrayLiteral = () => {
-      const from = offset()
-      shift()
-      const items = []
-      while (!isSymbol(']')) {
-        const item = expression()
-        items.push(item)
-        if (isSymbol(',')) { // accepts trailing comma
-          shift()
-        }
-      }
-      const arrayRange = range(from)
-      shift()
-      return array(arrayRange, ...items)
-    }
+    const arrayLiteral = () => {}
 
     const primaryExpression = () => {
killedBy: expression array [] = []
statusReason: UnexpectedTokenError: Unexpected token @1

[Killed] ArrayDeclaration
punyexpr.js:301:21
     const arrayLiteral = () => {
       const from = offset()
       shift()
-      const items = []
+      const items = ["Stryker was here"]
       while (!isSymbol(']')) {
         const item = expression()
killedBy: expression array [] = []
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "args": Array [],
+   "args": Array [

[Killed] ConditionalExpression
punyexpr.js:302:14
       const from = offset()
       shift()
       const items = []
-      while (!isSymbol(']')) {
+      while (false) {
         const item = expression()
         items.push(item)
killedBy: expression array [1] = [1]
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] BooleanLiteral
punyexpr.js:302:14
       const from = offset()
       shift()
       const items = []
-      while (!isSymbol(']')) {
+      while (isSymbol(']')) {
         const item = expression()
         items.push(item)
killedBy: expression array [] = []
statusReason: UnexpectedTokenError: Unexpected token @1

[Killed] ConditionalExpression
punyexpr.js:305:13
       while (!isSymbol(']')) {
         const item = expression()
         items.push(item)
-        if (isSymbol(',')) { // accepts trailing comma
+        if (false) { // accepts trailing comma
           shift()
         }
killedBy: expression array [1,] = [1]
statusReason: UnexpectedTokenError: Unexpected token @2

[Killed] BlockStatement
punyexpr.js:305:28
       while (!isSymbol(']')) {
         const item = expression()
         items.push(item)
-        if (isSymbol(',')) { // accepts trailing comma
-          shift()
-        }
+        if (isSymbol(',')) {}
       }
       const arrayRange = range(from)
killedBy: expression array [1,] = [1]
statusReason: UnexpectedTokenError: Unexpected token @2

[Killed] BlockStatement
punyexpr.js:316:26
 
     const primaryExpression = () => {
       checkNotEndOfExpression()
-      if (isSymbol('(')) {
-        shift()
-        const result = expression()
-        if (!isSymbol(')')) {
-          unexpected()
-        }
-        shift()
-        return result
-      }
+      if (isSymbol('(')) {}
       if (isSymbol('[')) {
         return arrayLiteral()
killedBy: expression basic (1 + 2) * 3 = 9
statusReason: UnexpectedTokenError: Unexpected token @0

[Killed] ConditionalExpression
punyexpr.js:316:11
 
     const primaryExpression = () => {
       checkNotEndOfExpression()
-      if (isSymbol('(')) {
+      if (false) {
         shift()
         const result = expression()
killedBy: expression basic (1 + 2) * 3 = 9
statusReason: UnexpectedTokenError: Unexpected token @0

[Killed] ConditionalExpression
punyexpr.js:319:13
       if (isSymbol('(')) {
         shift()
         const result = expression()
-        if (!isSymbol(')')) {
+        if (true) {
           unexpected()
         }
killedBy: expression basic (1 + 2) * 3 = 9
statusReason: UnexpectedTokenError: Unexpected token @6

[Killed] ConditionalExpression
punyexpr.js:319:13
       if (isSymbol('(')) {
         shift()
         const result = expression()
-        if (!isSymbol(')')) {
+        if (false) {
           unexpected()
         }
killedBy: expression error (1 + 2] = UnexpectedTokenError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
punyexpr.js:325:26
         shift()
         return result
       }
-      if (isSymbol('[')) {
-        return arrayLiteral()
-      }
+      if (isSymbol('[')) {}
       if (isSymbol()) {
         unexpected()
killedBy: expression array [] = []
statusReason: UnexpectedTokenError: Unexpected token @0

[Killed] ConditionalExpression
punyexpr.js:325:11
         shift()
         return result
       }
-      if (isSymbol('[')) {
+      if (true) {
         return arrayLiteral()
       }
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] ConditionalExpression
punyexpr.js:328:11
       if (isSymbol('[')) {
         return arrayLiteral()
       }
-      if (isSymbol()) {
+      if (false) {
         unexpected()
       }
killedBy: expression error * = UnexpectedTokenError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
punyexpr.js:328:23
       if (isSymbol('[')) {
         return arrayLiteral()
       }
-      if (isSymbol()) {
-        unexpected()
-      }
+      if (isSymbol()) {}
       const [[type, value, ...valueRange]] = shift()
       if (type === TOKEN_TYPE_IDENTIFIER) {
killedBy: expression error * = UnexpectedTokenError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] EqualityOperator
punyexpr.js:332:11
         unexpected()
       }
       const [[type, value, ...valueRange]] = shift()
-      if (type === TOKEN_TYPE_IDENTIFIER) {
+      if (type !== TOKEN_TYPE_IDENTIFIER) {
         return propertyOfContext(valueRange, constant(valueRange, value))
       }
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 7

  Object {
    "args": Array [
+     Object {

[Killed] ConditionalExpression
punyexpr.js:332:11
         unexpected()
       }
       const [[type, value, ...valueRange]] = shift()
-      if (type === TOKEN_TYPE_IDENTIFIER) {
+      if (true) {
         return propertyOfContext(valueRange, constant(valueRange, value))
       }
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 7

  Object {
    "args": Array [
+     Object {

[Killed] ConditionalExpression
punyexpr.js:335:11
       if (type === TOKEN_TYPE_IDENTIFIER) {
         return propertyOfContext(valueRange, constant(valueRange, value))
       }
-      if (type === TOKEN_TYPE_REGEX) {
+      if (false) {
         if (!options.regex) {
           const [from] = valueRange
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
punyexpr.js:335:11
       if (type === TOKEN_TYPE_IDENTIFIER) {
         return propertyOfContext(valueRange, constant(valueRange, value))
       }
-      if (type === TOKEN_TYPE_REGEX) {
+      if (true) {
         if (!options.regex) {
           const [from] = valueRange
killedBy: expression builds a function
statusReason: RegExpDisabledError: Regular expressions are disabled @0

[Killed] BlockStatement
punyexpr.js:336:29
         return propertyOfContext(valueRange, constant(valueRange, value))
       }
       if (type === TOKEN_TYPE_REGEX) {
-        if (!options.regex) {
-          const [from] = valueRange
-          PunyExprError.throw('RegExpDisabledError', `Regular expressions are disabled @${from}`, from)
-        }
+        if (!options.regex) {}
         const [source, flags] = value
         return regex(valueRange, source, flags)
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BooleanLiteral
punyexpr.js:336:13
         return propertyOfContext(valueRange, constant(valueRange, value))
       }
       if (type === TOKEN_TYPE_REGEX) {
-        if (!options.regex) {
+        if (options.regex) {
           const [from] = valueRange
           PunyExprError.throw('RegExpDisabledError', `Regular expressions are disabled @${from}`, from)
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] StringLiteral
punyexpr.js:338:31
       if (type === TOKEN_TYPE_REGEX) {
         if (!options.regex) {
           const [from] = valueRange
-          PunyExprError.throw('RegExpDisabledError', `Regular expressions are disabled @${from}`, from)
+          PunyExprError.throw("", `Regular expressions are disabled @${from}`, from)
         }
         const [source, flags] = value
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "RegExpDisabledError"
Received: ""

[Killed] BlockStatement
punyexpr.js:350:20
       const from = offset()
       let result = primaryExpression()
       const operators = {
-        '(': () => {
-          const args = []
-          while (!isSymbol(')')) {
-            if (args.length > 0) {
-              if (!isSymbol(',')) {
-                unexpected()
-              }
-              shift()
-            }
-            args.push(expression())
-          }
-          const callRange = range(from)
-          shift()
-          result = callFunction(callRange, result, args)
-        },
+        '(': () => {},
         '[': () => {
           const name = expression()
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedRemainderError: Unexpected left over tokens @12
