[Killed] ArrayDeclaration
punyexpr.js:351:24
       let result = primaryExpression()
       const operators = {
         '(': () => {
-          const args = []
+          const args = ["Stryker was here"]
           while (!isSymbol(')')) {
             if (args.length > 0) {
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedTokenError: Unexpected token @12

[Killed] BooleanLiteral
punyexpr.js:352:18
       const operators = {
         '(': () => {
           const args = []
-          while (!isSymbol(')')) {
+          while (isSymbol(')')) {
             if (args.length > 0) {
               if (!isSymbol(',')) {
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedRemainderError: Unexpected left over tokens @13

[Killed] ConditionalExpression
punyexpr.js:352:18
       const operators = {
         '(': () => {
           const args = []
-          while (!isSymbol(')')) {
+          while (false) {
             if (args.length > 0) {
               if (!isSymbol(',')) {
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedRemainderError: Unexpected left over tokens @13

[Killed] BlockStatement
punyexpr.js:353:34
         '(': () => {
           const args = []
           while (!isSymbol(')')) {
-            if (args.length > 0) {
-              if (!isSymbol(',')) {
-                unexpected()
-              }
-              shift()
-            }
+            if (args.length > 0) {}
             args.push(expression())
           }
killedBy: expression contextual object.method(1,2) = "OK1,2"
statusReason: UnexpectedTokenError: Unexpected token @15

[Killed] EqualityOperator
punyexpr.js:353:17
         '(': () => {
           const args = []
           while (!isSymbol(')')) {
-            if (args.length > 0) {
+            if (args.length <= 0) {
               if (!isSymbol(',')) {
                 unexpected()
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedTokenError: Unexpected token @12

[Killed] ConditionalExpression
punyexpr.js:354:19
           const args = []
           while (!isSymbol(')')) {
             if (args.length > 0) {
-              if (!isSymbol(',')) {
+              if (true) {
                 unexpected()
               }
killedBy: expression contextual object.method(1,2) = "OK1,2"
statusReason: UnexpectedTokenError: Unexpected token @15

[Killed] BlockStatement
punyexpr.js:354:35
           const args = []
           while (!isSymbol(')')) {
             if (args.length > 0) {
-              if (!isSymbol(',')) {
-                unexpected()
-              }
+              if (!isSymbol(',')) {}
               shift()
             }
killedBy: expression error a(1] = UnexpectedTokenError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "UnexpectedTokenError"
Received: "EndOfExpressionError"

[Killed] BlockStatement
punyexpr.js:365:20
           shift()
           result = callFunction(callRange, result, args)
         },
-        '[': () => {
-          const name = expression()
-          if (!isSymbol(']')) {
-            unexpected()
-          }
-          const propertyRange = range(from)
-          shift()
-          result = propertyOf(propertyRange, result, name)
-        },
+        '[': () => {},
         '.': () => {
           const [type, value, ...valueRange] = current()
killedBy: expression contextual object["property1"] = 1
statusReason: UnexpectedRemainderError: Unexpected left over tokens @7

[Killed] BlockStatement
punyexpr.js:367:31
         },
         '[': () => {
           const name = expression()
-          if (!isSymbol(']')) {
-            unexpected()
-          }
+          if (!isSymbol(']')) {}
           const propertyRange = range(from)
           shift()
killedBy: expression error a[1) = UnexpectedTokenError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
punyexpr.js:367:15
         },
         '[': () => {
           const name = expression()
-          if (!isSymbol(']')) {
+          if (false) {
             unexpected()
           }
killedBy: expression error a[1) = UnexpectedTokenError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
punyexpr.js:374:20
           shift()
           result = propertyOf(propertyRange, result, name)
         },
-        '.': () => {
-          const [type, value, ...valueRange] = current()
-          if (type !== TOKEN_TYPE_IDENTIFIER) {
-            unexpected()
-          }
-          const propertyRange = range(from)
-          shift()
-          result = propertyOf(propertyRange, result, constant(valueRange, value))
-        }
+        '.': () => {}
       }
       while (isSymbol('([.')) {
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedRemainderError: Unexpected left over tokens @4

[Killed] ConditionalExpression
punyexpr.js:376:15
         },
         '.': () => {
           const [type, value, ...valueRange] = current()
-          if (type !== TOKEN_TYPE_IDENTIFIER) {
+          if (true) {
             unexpected()
           }
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedTokenError: Unexpected token @4

[Killed] ConditionalExpression
punyexpr.js:376:15
         },
         '.': () => {
           const [type, value, ...valueRange] = current()
-          if (type !== TOKEN_TYPE_IDENTIFIER) {
+          if (false) {
             unexpected()
           }
killedBy: expression error a.+ = UnexpectedTokenError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
punyexpr.js:384:14
           result = propertyOf(propertyRange, result, constant(valueRange, value))
         }
       }
-      while (isSymbol('([.')) {
+      while (false) {
         const [[, symbol]] = shift()
         operators[symbol]()
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedRemainderError: Unexpected left over tokens @3

[Timeout] BlockStatement
punyexpr.js:384:31
           result = propertyOf(propertyRange, result, constant(valueRange, value))
         }
       }
-      while (isSymbol('([.')) {
-        const [[, symbol]] = shift()
-        operators[symbol]()
-      }
+      while (isSymbol('([.')) {}
       return result
     }

[Killed] BlockStatement
punyexpr.js:391:35
       return result
     }
 
-    const unaryExpression = () => {
-      const [type, value, from] = current()
-      const postProcess = isSymbol('+-!') || ((type === TOKEN_TYPE_IDENTIFIER) && value === 'typeof')
-      if (!postProcess) {
-        return CallOrMemberExpression()
-      }
-      const unaryRange = range(from)
-      shift()
-      let result = expression()
-      // + is absorbed
-      if (value === '-') {
-        result = neg(unaryRange, result)
-      } else if (value === '!') {
-        result = not(unaryRange, result)
-      } else if (value === 'typeof') {
-        result = getTypeof(unaryRange, result)
-      }
-      return result
-    }
+    const unaryExpression = () => {}
 
     const _recursiveExpression = (subExpression, operators) => {
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @0

[Killed] LogicalOperator
punyexpr.js:393:47
 
     const unaryExpression = () => {
       const [type, value, from] = current()
-      const postProcess = isSymbol('+-!') || ((type === TOKEN_TYPE_IDENTIFIER) && value === 'typeof')
+      const postProcess = isSymbol('+-!') || (type === TOKEN_TYPE_IDENTIFIER || value === 'typeof')
       if (!postProcess) {
         return CallOrMemberExpression()
killedBy: expression basic "typeof" = "typeof"
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] EqualityOperator
punyexpr.js:393:48
 
     const unaryExpression = () => {
       const [type, value, from] = current()
-      const postProcess = isSymbol('+-!') || ((type === TOKEN_TYPE_IDENTIFIER) && value === 'typeof')
+      const postProcess = isSymbol('+-!') || ((type !== TOKEN_TYPE_IDENTIFIER) && value === 'typeof')
       if (!postProcess) {
         return CallOrMemberExpression()
killedBy: expression basic typeof 1 = "number"
statusReason: UnexpectedRemainderError: Unexpected left over tokens @7

[Killed] BlockStatement
punyexpr.js:394:25
     const unaryExpression = () => {
       const [type, value, from] = current()
       const postProcess = isSymbol('+-!') || ((type === TOKEN_TYPE_IDENTIFIER) && value === 'typeof')
-      if (!postProcess) {
-        return CallOrMemberExpression()
-      }
+      if (!postProcess) {}
       const unaryRange = range(from)
       shift()
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] ConditionalExpression
punyexpr.js:394:11
     const unaryExpression = () => {
       const [type, value, from] = current()
       const postProcess = isSymbol('+-!') || ((type === TOKEN_TYPE_IDENTIFIER) && value === 'typeof')
-      if (!postProcess) {
+      if (true) {
         return CallOrMemberExpression()
       }
killedBy: expression basic typeof 1 = "number"
statusReason: UnexpectedRemainderError: Unexpected left over tokens @7

[Killed] EqualityOperator
punyexpr.js:401:11
       shift()
       let result = expression()
       // + is absorbed
-      if (value === '-') {
+      if (value !== '-') {
         result = neg(unaryRange, result)
       } else if (value === '!') {
killedBy: expression basic typeof 1 = "number"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -9,7 +9,7 @@
        "op": "constant",
      },

[Killed] ConditionalExpression
punyexpr.js:401:11
       shift()
       let result = expression()
       // + is absorbed
-      if (value === '-') {
+      if (false) {
         result = neg(unaryRange, result)
       } else if (value === '!') {
killedBy: expression basic -1 = -1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 0

  Object {
    "args": Array [
-     Object {

[Killed] ConditionalExpression
punyexpr.js:403:18
       // + is absorbed
       if (value === '-') {
         result = neg(unaryRange, result)
-      } else if (value === '!') {
+      } else if (false) {
         result = not(unaryRange, result)
       } else if (value === 'typeof') {
killedBy: expression basic !true = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 0

  Object {
    "args": Array [
-     Object {

[Killed] BlockStatement
punyexpr.js:403:33
       // + is absorbed
       if (value === '-') {
         result = neg(unaryRange, result)
-      } else if (value === '!') {
-        result = not(unaryRange, result)
-      } else if (value === 'typeof') {
+      } else if (value === '!') {} else if (value === 'typeof') {
         result = getTypeof(unaryRange, result)
       }
killedBy: expression basic !true = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 0

  Object {
    "args": Array [
-     Object {

[Killed] EqualityOperator
punyexpr.js:405:18
         result = neg(unaryRange, result)
       } else if (value === '!') {
         result = not(unaryRange, result)
-      } else if (value === 'typeof') {
+      } else if (value !== 'typeof') {
         result = getTypeof(unaryRange, result)
       }
killedBy: expression basic typeof 1 = "number"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 0

  Object {
    "args": Array [
-     Object {

[Killed] ConditionalExpression
punyexpr.js:405:18
         result = neg(unaryRange, result)
       } else if (value === '!') {
         result = not(unaryRange, result)
-      } else if (value === 'typeof') {
+      } else if (false) {
         result = getTypeof(unaryRange, result)
       }
killedBy: expression basic typeof 1 = "number"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 0

  Object {
    "args": Array [
-     Object {

[Killed] BlockStatement
punyexpr.js:411:64
       return result
     }
 
-    const _recursiveExpression = (subExpression, operators) => {
-      const expectedSymbols = Object.keys(operators)
-      return () => {
-        const from = offset()
-        let result = subExpression()
-        let symbol = shiftOnSymbols(expectedSymbols)
-        while (symbol) {
-          const sub = subExpression()
-          const recursiveRange = range(from, sub)
-          result = operators[symbol](recursiveRange, result, sub)
-          symbol = shiftOnSymbols(expectedSymbols)
-        }
-        return result
-      }
-    }
+    const _recursiveExpression = (subExpression, operators) => {}
 
     const exponentiationExpression = _recursiveExpression(unaryExpression, {
killedBy: expression builds a function
statusReason: TypeError: logicalORExpression is not a function

[Killed] BlockStatement
punyexpr.js:413:20
 
     const _recursiveExpression = (subExpression, operators) => {
       const expectedSymbols = Object.keys(operators)
-      return () => {
-        const from = offset()
-        let result = subExpression()
-        let symbol = shiftOnSymbols(expectedSymbols)
-        while (symbol) {
-          const sub = subExpression()
-          const recursiveRange = range(from, sub)
-          result = operators[symbol](recursiveRange, result, sub)
-          symbol = shiftOnSymbols(expectedSymbols)
-        }
-        return result
-      }
+      return () => {}
     }
 
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @0

[Killed] ConditionalExpression
punyexpr.js:417:16
         const from = offset()
         let result = subExpression()
         let symbol = shiftOnSymbols(expectedSymbols)
-        while (symbol) {
+        while (false) {
           const sub = subExpression()
           const recursiveRange = range(from, sub)
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @4

[Timeout] BlockStatement
punyexpr.js:417:24
         const from = offset()
         let result = subExpression()
         let symbol = shiftOnSymbols(expectedSymbols)
-        while (symbol) {
-          const sub = subExpression()
-          const recursiveRange = range(from, sub)
-          result = operators[symbol](recursiveRange, result, sub)
-          symbol = shiftOnSymbols(expectedSymbols)
-        }
+        while (symbol) {}
         return result
       }

[Killed] ObjectLiteral
punyexpr.js:431:85
       '**': exp
     })
 
-    const multiplicativeExpression = _recursiveExpression(exponentiationExpression, {
-      '*': mul,
-      '/': div,
-      '%': remainder
-    })
+    const multiplicativeExpression = _recursiveExpression(exponentiationExpression, {})
 
     const additiveExpression = _recursiveExpression(multiplicativeExpression, {
killedBy: expression basic 2 * 3 = 6
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] ObjectLiteral
punyexpr.js:442:75
       '-': sub
     })
 
-    const relationalExpression = _recursiveExpression(additiveExpression, {
-      '<': lt,
-      '>': gt,
-      '<=': lte,
-      '>=': gte
-    })
+    const relationalExpression = _recursiveExpression(additiveExpression, {})
 
     const equalityExpression = _recursiveExpression(relationalExpression, {
killedBy: expression basic 2 < 2 = false
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] BlockStatement
punyexpr.js:464:41
       '||': or
     })
 
-    const conditionalExpression = () => {
-      const from = offset()
-      const condition = logicalORExpression()
-      if (shiftOnSymbols(['?'])) {
-        const trueResult = conditionalExpression()
-        checkNotEndOfExpression()
-        if (!isSymbol(':')) {
-          unexpected()
-        }
-        shift()
-        const falseResult = conditionalExpression()
-        const conditionRange = range(from, falseResult)
-        return ternary(conditionRange, condition, trueResult, falseResult)
-      }
-      return condition
-    }
+    const conditionalExpression = () => {}
 
     const expression = conditionalExpression
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @0

[Killed] BlockStatement
punyexpr.js:467:34
     const conditionalExpression = () => {
       const from = offset()
       const condition = logicalORExpression()
-      if (shiftOnSymbols(['?'])) {
-        const trueResult = conditionalExpression()
-        checkNotEndOfExpression()
-        if (!isSymbol(':')) {
-          unexpected()
-        }
-        shift()
-        const falseResult = conditionalExpression()
-        const conditionRange = range(from, falseResult)
-        return ternary(conditionRange, condition, trueResult, falseResult)
-      }
+      if (shiftOnSymbols(['?'])) {}
       return condition
     }
killedBy: expression ternary true ? 1 : 2 = 1
statusReason: UnexpectedRemainderError: Unexpected left over tokens @7

[Killed] ConditionalExpression
punyexpr.js:467:11
     const conditionalExpression = () => {
       const from = offset()
       const condition = logicalORExpression()
-      if (shiftOnSymbols(['?'])) {
+      if (true) {
         const trueResult = conditionalExpression()
         checkNotEndOfExpression()
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] BlockStatement
punyexpr.js:470:29
       if (shiftOnSymbols(['?'])) {
         const trueResult = conditionalExpression()
         checkNotEndOfExpression()
-        if (!isSymbol(':')) {
-          unexpected()
-        }
+        if (!isSymbol(':')) {}
         shift()
         const falseResult = conditionalExpression()
killedBy: expression error 1 ? 2 2 = UnexpectedTokenError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "UnexpectedTokenError"
Received: "EndOfExpressionError"

[Killed] ConditionalExpression
punyexpr.js:470:13
       if (shiftOnSymbols(['?'])) {
         const trueResult = conditionalExpression()
         checkNotEndOfExpression()
-        if (!isSymbol(':')) {
+        if (false) {
           unexpected()
         }
killedBy: expression error 1 ? 2 2 = UnexpectedTokenError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "UnexpectedTokenError"
Received: "EndOfExpressionError"

[Killed] BlockStatement
punyexpr.js:483:25
 
     const expression = conditionalExpression
 
-    return (...args) => {
-      [tokens, options] = args
-      const result = expression()
-      if (tokens.length !== 0) {
-        PunyExprError.throw('UnexpectedRemainderError', `Unexpected left over tokens @${offset()}`, offset())
-      }
-      return result
-    }
+    return (...args) => {}
   })()
 
killedBy: expression basic 1 = 1
statusReason: TypeError: Cannot read properties of undefined (reading '$')

[Killed] EqualityOperator
punyexpr.js:486:11
     return (...args) => {
       [tokens, options] = args
       const result = expression()
-      if (tokens.length !== 0) {
+      if (tokens.length === 0) {
         PunyExprError.throw('UnexpectedRemainderError', `Unexpected left over tokens @${offset()}`, offset())
       }
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] ConditionalExpression
punyexpr.js:486:11
     return (...args) => {
       [tokens, options] = args
       const result = expression()
-      if (tokens.length !== 0) {
+      if (false) {
         PunyExprError.throw('UnexpectedRemainderError', `Unexpected left over tokens @${offset()}`, offset())
       }
killedBy: expression error 1 2 = UnexpectedRemainderError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
punyexpr.js:508:26
     )
   }
 
-  const toJSON = expr => {
-    const [op, args, [at, length]] = expr.$
-    return {
-      op,
-      at,
-      length,
-      args: args.map(arg => {
-        // eslint-disable-next-line valid-typeof
-        if (typeof arg === FUNCTION) {
-          return toJSON(arg)
-        }
-        if (Array.isArray(arg)) {
-          return arg.map(toJSON)
-        }
-        return arg
-      })
-    }
-  }
+  const toJSON = expr => {}
 
   const punyexpr = (str, options = {}) => {
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"args": [1], "at": 0, "length": 1, "op": "constant"}
Received: undefined

[Killed] ObjectLiteral
punyexpr.js:510:12
 
   const toJSON = expr => {
     const [op, args, [at, length]] = expr.$
-    return {
-      op,
-      at,
-      length,
-      args: args.map(arg => {
-        // eslint-disable-next-line valid-typeof
-        if (typeof arg === FUNCTION) {
-          return toJSON(arg)
-        }
-        if (Array.isArray(arg)) {
-          return arg.map(toJSON)
-        }
-        return arg
-      })
-    }
+    return {}
   }
 
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "args": Array [
-     1,

[Killed] BlockStatement
punyexpr.js:514:29
       op,
       at,
       length,
-      args: args.map(arg => {
-        // eslint-disable-next-line valid-typeof
-        if (typeof arg === FUNCTION) {
-          return toJSON(arg)
-        }
-        if (Array.isArray(arg)) {
-          return arg.map(toJSON)
-        }
-        return arg
-      })
+      args: args.map(arg => {})
     }
   }
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "args": Array [
-     1,

[Killed] ConditionalExpression
punyexpr.js:516:13
       length,
       args: args.map(arg => {
         // eslint-disable-next-line valid-typeof
-        if (typeof arg === FUNCTION) {
+        if (false) {
           return toJSON(arg)
         }
killedBy: expression basic 1 + 2 = 3
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 16
+ Received  +  2

  Object {
    "args": Array [
-     Object {

[Killed] EqualityOperator
punyexpr.js:516:13
       length,
       args: args.map(arg => {
         // eslint-disable-next-line valid-typeof
-        if (typeof arg === FUNCTION) {
+        if (typeof arg !== FUNCTION) {
           return toJSON(arg)
         }
killedBy: expression basic 1 = 1
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
punyexpr.js:519:13
         if (typeof arg === FUNCTION) {
           return toJSON(arg)
         }
-        if (Array.isArray(arg)) {
+        if (true) {
           return arg.map(toJSON)
         }
killedBy: expression basic 1 = 1
statusReason: TypeError: arg.map is not a function

[Killed] BlockStatement
punyexpr.js:519:33
         if (typeof arg === FUNCTION) {
           return toJSON(arg)
         }
-        if (Array.isArray(arg)) {
-          return arg.map(toJSON)
-        }
+        if (Array.isArray(arg)) {}
         return arg
       })
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

@@ -22,18 +22,11 @@
        "at": 0,
        "length": 11,

[Killed] BlockStatement
punyexpr.js:527:43
     }
   }
 
-  const punyexpr = (str, options = {}) => {
-    const impl = parse(tokenize(str), {
-      regex: false,
-      ...options
-    })
-    const expr = (context = {}) => impl(context)
-    assignROProperties(expr, {
-      toJSON: toJSON.bind(null, impl),
-      toString: () => str
-    })
-    return expr
-  }
+  const punyexpr = (str, options = {}) => {}
 
   assignROProperties(punyexpr, {
killedBy: expression builds a function
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "function"
Received: "undefined"

[Killed] BooleanLiteral
punyexpr.js:529:14
 
   const punyexpr = (str, options = {}) => {
     const impl = parse(tokenize(str), {
-      regex: false,
+      regex: true,
       ...options
     })
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ArrowFunction
punyexpr.js:532:18
       regex: false,
       ...options
     })
-    const expr = (context = {}) => impl(context)
+    const expr = () => undefined
     assignROProperties(expr, {
       toJSON: toJSON.bind(null, impl),
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] ObjectLiteral
punyexpr.js:533:30
       ...options
     })
     const expr = (context = {}) => impl(context)
-    assignROProperties(expr, {
-      toJSON: toJSON.bind(null, impl),
-      toString: () => str
-    })
+    assignROProperties(expr, {})
     return expr
   }
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "1"
Received: "(context = {}) => impl(context)"

[Killed] ArrowFunction
punyexpr.js:535:17
     const expr = (context = {}) => impl(context)
     assignROProperties(expr, {
       toJSON: toJSON.bind(null, impl),
-      toString: () => str
+      toString: () => undefined
     })
     return expr
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "1"
Received: undefined

[Killed] StringLiteral
punyexpr.js:543:14
   assignROProperties(punyexpr, {
     tokenize,
     Error: PunyExprError,
-    version: '0.0.0'
+    version: ""
   })
 
killedBy: version exposes the version information
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.0.0"
Received: ""
