[Killed] ArrowFunction
punyexpr.js:202:37
   Expression :
     ConditionalExpression
 */
-    const buildOp = (name, impl) => (range, ...args) => Object.assign(impl.bind(null, ...args), { [OP_DETAILS]: [name, args, range] })
+    const buildOp = (name, impl) => () => undefined
 
     const constant = buildOp('constant', value => value)
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] ArrowFunction
punyexpr.js:202:21
   Expression :
     ConditionalExpression
 */
-    const buildOp = (name, impl) => (range, ...args) => Object.assign(impl.bind(null, ...args), { [OP_DETAILS]: [name, args, range] })
+    const buildOp = () => undefined
 
     const constant = buildOp('constant', value => value)
killedBy: expression builds a function
statusReason: TypeError: constant is not a function

[Killed] ArrowFunction
punyexpr.js:209:36
       const context = itemsAndContext[itemsAndContext.length - 1]
       return itemsAndContext.slice(0, -1).map(item => item(context))
     })
-    const regex = buildOp('regex', (pattern, flags, builder) => builder(pattern, flags))
+    const regex = buildOp('regex', () => undefined)
     const regexDefaultBuilder = (pattern, flags) => new RegExp(pattern, flags)
     const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
killedBy: expression regex when allowed /abc/ = {}
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: /abc/
Received: undefined

[Killed] StringLiteral
punyexpr.js:209:27
       const context = itemsAndContext[itemsAndContext.length - 1]
       return itemsAndContext.slice(0, -1).map(item => item(context))
     })
-    const regex = buildOp('regex', (pattern, flags, builder) => builder(pattern, flags))
+    const regex = buildOp("", (pattern, flags, builder) => builder(pattern, flags))
     const regexDefaultBuilder = (pattern, flags) => new RegExp(pattern, flags)
     const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
killedBy: expression regex when allowed /abc/ = {}
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,7 +3,7 @@
      "abc",
      "",

[Killed] ArrowFunction
punyexpr.js:210:33
       return itemsAndContext.slice(0, -1).map(item => item(context))
     })
     const regex = buildOp('regex', (pattern, flags, builder) => builder(pattern, flags))
-    const regexDefaultBuilder = (pattern, flags) => new RegExp(pattern, flags)
+    const regexDefaultBuilder = () => undefined
     const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
     const propertyOf = buildOp('property', (object, name, context) => {
killedBy: expression regex when allowed /abc/ = {}
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: /abc/
Received: undefined

[Killed] ArrowFunction
punyexpr.js:211:50
     })
     const regex = buildOp('regex', (pattern, flags, builder) => builder(pattern, flags))
     const regexDefaultBuilder = (pattern, flags) => new RegExp(pattern, flags)
-    const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
+    const propertyOfContext = buildOp('context', () => undefined)
     const propertyOf = buildOp('property', (object, name, context) => {
       const that = object(context)
killedBy: expression contextual hello = "World !"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "World !"
Received: undefined

[Killed] StringLiteral
punyexpr.js:211:39
     })
     const regex = buildOp('regex', (pattern, flags, builder) => builder(pattern, flags))
     const regexDefaultBuilder = (pattern, flags) => new RegExp(pattern, flags)
-    const propertyOfContext = buildOp('context', (name, context) => context[name(context)])
+    const propertyOfContext = buildOp("", (name, context) => context[name(context)])
     const propertyOf = buildOp('property', (object, name, context) => {
       const that = object(context)
killedBy: expression contextual hello = "World !"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -9,7 +9,7 @@
        "op": "constant",
      },

[Killed] ConditionalExpression
punyexpr.js:216:11
       const that = object(context)
       const result = that[name(context)]
       // eslint-disable-next-line valid-typeof
-      if (typeof result === FUNCTION) {
+      if (false) {
         return result.bind(that)
       }
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: TypeError: Number.prototype.toFixed requires that 'this' be a Number

[Killed] ArrowFunction
punyexpr.js:222:32
       return result
     })
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
-    const pos = buildOp('pos', (value, context) => +value(context))
+    const pos = buildOp('pos', () => undefined)
     const neg = buildOp('neg', (value, context) => -value(context))
     const not = buildOp('not', (value, context) => !value(context))
killedBy: expression basic +1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] UnaryOperator
punyexpr.js:222:52
       return result
     })
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
-    const pos = buildOp('pos', (value, context) => +value(context))
+    const pos = buildOp('pos', (value, context) => -value(context))
     const neg = buildOp('neg', (value, context) => -value(context))
     const not = buildOp('not', (value, context) => !value(context))
killedBy: expression basic +1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] UnaryOperator
punyexpr.js:223:52
     })
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
     const pos = buildOp('pos', (value, context) => +value(context))
-    const neg = buildOp('neg', (value, context) => -value(context))
+    const neg = buildOp('neg', (value, context) => +value(context))
     const not = buildOp('not', (value, context) => !value(context))
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
killedBy: expression basic -1 = -1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: -1
Received: 1

[Killed] ArrowFunction
punyexpr.js:223:32
     })
     const callFunction = buildOp('call', (func, args, context) => func(context).apply(null, args.map(arg => arg(context))))
     const pos = buildOp('pos', (value, context) => +value(context))
-    const neg = buildOp('neg', (value, context) => -value(context))
+    const neg = buildOp('neg', () => undefined)
     const not = buildOp('not', (value, context) => !value(context))
     const getTypeof = buildOp('getTypeof', (value, context) => typeof value(context))
killedBy: expression basic -1 = -1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: -1
Received: undefined

[Killed] EqualityOperator
punyexpr.js:232:59
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
-    const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
+    const lt = buildOp('lt', (value1, value2, context) => value1(context) >= value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
killedBy: expression basic 2 < 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ArrowFunction
punyexpr.js:232:30
     const remainder = buildOp('remainder', (value1, value2, context) => value1(context) % value2(context))
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
-    const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
+    const lt = buildOp('lt', () => undefined)
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
killedBy: expression basic 2 < 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] ArrowFunction
punyexpr.js:233:30
     const add = buildOp('add', (value1, value2, context) => value1(context) + value2(context))
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
-    const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
+    const gt = buildOp('gt', () => undefined)
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
killedBy: expression basic 2 > 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] ArrowFunction
punyexpr.js:234:32
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
-    const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
+    const lte = buildOp('lte', () => undefined)
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
     // eslint-disable-next-line eqeqeq
killedBy: expression basic 2 <= 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] EqualityOperator
punyexpr.js:234:61
     const sub = buildOp('sub', (value1, value2, context) => value1(context) - value2(context))
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
-    const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
+    const lte = buildOp('lte', (value1, value2, context) => value1(context) > value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
     // eslint-disable-next-line eqeqeq
killedBy: expression basic 2 <= 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
punyexpr.js:235:61
     const lt = buildOp('lt', (value1, value2, context) => value1(context) < value2(context))
     const gt = buildOp('gt', (value1, value2, context) => value1(context) > value2(context))
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
-    const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
+    const gte = buildOp('gte', (value1, value2, context) => value1(context) > value2(context))
     // eslint-disable-next-line eqeqeq
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
killedBy: expression basic 2 >= 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:237:59
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
     // eslint-disable-next-line eqeqeq
-    const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
+    const eq = buildOp('eq', (value1, value2, context) => false)
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
killedBy: expression basic 2 == 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:237:59
     const lte = buildOp('lte', (value1, value2, context) => value1(context) <= value2(context))
     const gte = buildOp('gte', (value1, value2, context) => value1(context) >= value2(context))
     // eslint-disable-next-line eqeqeq
-    const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
+    const eq = buildOp('eq', (value1, value2, context) => true)
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
killedBy: expression basic 1 == 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
punyexpr.js:239:61
     // eslint-disable-next-line eqeqeq
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
     // eslint-disable-next-line eqeqeq
-    const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
+    const neq = buildOp('neq', (value1, value2, context) => true)
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
killedBy: expression basic 2 != 2 = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
punyexpr.js:240:61
     const eq = buildOp('eq', (value1, value2, context) => value1(context) == value2(context))
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
-    const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
+    const eqq = buildOp('eqq', (value1, value2, context) => false)
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
killedBy: expression basic 2 === 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
punyexpr.js:241:63
     // eslint-disable-next-line eqeqeq
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
-    const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
+    const neqq = buildOp('neqq', (value1, value2, context) => value1(context) === value2(context))
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
killedBy: expression basic 1 !== 2 = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:242:61
     const neq = buildOp('neq', (value1, value2, context) => value1(context) != value2(context))
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
-    const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
+    const and = buildOp('and', (value1, value2, context) => false)
     const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
     const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
killedBy: expression basic true && true = true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
punyexpr.js:243:59
     const eqq = buildOp('eqq', (value1, value2, context) => value1(context) === value2(context))
     const neqq = buildOp('neqq', (value1, value2, context) => value1(context) !== value2(context))
     const and = buildOp('and', (value1, value2, context) => value1(context) && value2(context))
-    const or = buildOp('or', (value1, value2, context) => value1(context) || value2(context))
+    const or = buildOp('or', (value1, value2, context) => true)
     const ternary = buildOp('ternary', (condition, trueValue, falseValue, context) => {
       if (condition(context)) {
killedBy: expression basic false || false = false
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
punyexpr.js:255:32
     let options
 
     const checkNotEndOfExpression = () => {
-      if (tokens.length === 0) {
-        PunyExprError.throw('EndOfExpressionError', 'Unexpected end of expression')
-      }
+      if (tokens.length === 0) {}
     }
     const current = () => {
killedBy: expression error + = EndOfExpressionError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "EndOfExpressionError"
Received: "TypeError"

[Killed] BlockStatement
punyexpr.js:264:33
       return tokens[0]
     }
     const offset = () => current()[2]
-    const range = (from, op) => {
-      let currentRange
-      if (op) {
-        currentRange = op[OP_DETAILS][2]
-      } else {
-        currentRange = current().splice(2)
-      }
-      const [offset, length] = currentRange
-      return [from, offset + length - from]
-    }
+    const range = (from, op) => {}
     const shift = (steps = 1) => tokens.splice(0, steps)
     const isSymbol = (expected = undefined) => {
killedBy: expression basic 1 + 2 = 3
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
punyexpr.js:266:15
     const offset = () => current()[2]
     const range = (from, op) => {
       let currentRange
-      if (op) {
-        currentRange = op[OP_DETAILS][2]
-      } else {
+      if (op) {} else {
         currentRange = current().splice(2)
       }
killedBy: expression builds a function
statusReason: TypeError: currentRange is not iterable

[Killed] BlockStatement
punyexpr.js:268:14
       let currentRange
       if (op) {
         currentRange = op[OP_DETAILS][2]
-      } else {
-        currentRange = current().splice(2)
-      }
+      } else {}
       const [offset, length] = currentRange
       return [from, offset + length - from]
killedBy: expression basic typeof 1 = "number"
statusReason: TypeError: currentRange is not iterable

[Killed] BlockStatement
punyexpr.js:295:21
       const matching = expected
         .filter(symbol => nextSymbolsAggregated.startsWith(symbol))
         .sort((a, b) => b.length - a.length)[0]
-      if (matching) {
-        shift(matching.length)
-        return matching
-      }
+      if (matching) {}
       return false
     }
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @2

[Killed] BlockStatement
punyexpr.js:324:29
       if (isSymbol('(')) {
         shift()
         const result = expression()
-        if (!isSymbol(')')) {
-          unexpected()
-        }
+        if (!isSymbol(')')) {}
         shift()
         return result
killedBy: expression error (1 + 2] = UnexpectedTokenError
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] EqualityOperator
punyexpr.js:340:11
       if (type === TOKEN_TYPE_IDENTIFIER) {
         return propertyOfContext(valueRange, constant(valueRange, value))
       }
-      if (type === TOKEN_TYPE_REGEX) {
+      if (type !== TOKEN_TYPE_REGEX) {
         if (!options.regex) {
           const [from] = valueRange
killedBy: expression builds a function
statusReason: RegExpDisabledError: Regular expressions are disabled @0

[Killed] StringLiteral
punyexpr.js:343:54
       if (type === TOKEN_TYPE_REGEX) {
         if (!options.regex) {
           const [from] = valueRange
-          PunyExprError.throw('RegExpDisabledError', `Regular expressions are disabled @${from}`, from)
+          PunyExprError.throw('RegExpDisabledError', ``, from)
         }
         const [pattern, flags] = value
killedBy: expression regex when not allowed /abc/ = RegExpDisabledError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "Regular expressions are disabled @0"
Received: ""

[Killed] BlockStatement
punyexpr.js:348:42
         const [pattern, flags] = value
         let builder = options.regex
         // eslint-disable-next-line valid-typeof
-        if (typeof builder !== FUNCTION) {
-          builder = regexDefaultBuilder
-        }
+        if (typeof builder !== FUNCTION) {}
         return regex(valueRange, pattern, flags, builder)
       }
killedBy: expression regex when allowed /abc/ = {}
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
    "args": Array [
      "abc",

[Killed] ConditionalExpression
punyexpr.js:348:13
         const [pattern, flags] = value
         let builder = options.regex
         // eslint-disable-next-line valid-typeof
-        if (typeof builder !== FUNCTION) {
+        if (false) {
           builder = regexDefaultBuilder
         }
killedBy: expression regex when allowed /abc/ = {}
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
    "args": Array [
      "abc",

[Killed] ConditionalExpression
punyexpr.js:363:17
         '(': () => {
           const args = []
           while (!isSymbol(')')) {
-            if (args.length > 0) {
+            if (false) {
               if (!isSymbol(',')) {
                 unexpected()
killedBy: expression contextual object.method(1,2) = "OK1,2"
statusReason: UnexpectedTokenError: Unexpected token @15

[Killed] ConditionalExpression
punyexpr.js:363:17
         '(': () => {
           const args = []
           while (!isSymbol(')')) {
-            if (args.length > 0) {
+            if (true) {
               if (!isSymbol(',')) {
                 unexpected()
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: UnexpectedTokenError: Unexpected token @12

[Killed] ConditionalExpression
punyexpr.js:364:19
           const args = []
           while (!isSymbol(')')) {
             if (args.length > 0) {
-              if (!isSymbol(',')) {
+              if (false) {
                 unexpected()
               }
killedBy: expression error a(1] = UnexpectedTokenError
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "UnexpectedTokenError"
Received: "EndOfExpressionError"

[Killed] BooleanLiteral
punyexpr.js:377:15
         },
         '[': () => {
           const name = expression()
-          if (!isSymbol(']')) {
+          if (isSymbol(']')) {
             unexpected()
           }
killedBy: expression contextual object["property1"] = 1
statusReason: UnexpectedTokenError: Unexpected token @18

[Killed] ObjectLiteral
punyexpr.js:401:25
       return result
     }
 
-    const unaryMapper = {
-      '+': pos,
-      '-': neg,
-      '!': not,
-      typeof: getTypeof
-    }
+    const unaryMapper = {}
 
     const unaryExpression = () => {
killedBy: expression basic typeof 1 = "number"
statusReason: TypeError: func is not a function

[Killed] BlockStatement
punyexpr.js:408:35
       typeof: getTypeof
     }
 
-    const unaryExpression = () => {
-      const [type, value, from] = current()
-      const postProcess = isSymbol('+-!') || ((type === TOKEN_TYPE_IDENTIFIER) && value === 'typeof')
-      if (!postProcess) {
-        return CallOrMemberExpression()
-      }
-      const unaryRange = range(from)
-      shift()
-      const func = unaryMapper[value]
-      return func(unaryRange, unaryExpression())
-    }
+    const unaryExpression = () => {}
 
     const _recursiveExpression = (subExpression, operators) => {
killedBy: expression builds a function
statusReason: UnexpectedRemainderError: Unexpected left over tokens @0

[Killed] ConditionalExpression
punyexpr.js:410:83
 
     const unaryExpression = () => {
       const [type, value, from] = current()
-      const postProcess = isSymbol('+-!') || ((type === TOKEN_TYPE_IDENTIFIER) && value === 'typeof')
+      const postProcess = isSymbol('+-!') || ((type === TOKEN_TYPE_IDENTIFIER) && true)
       if (!postProcess) {
         return CallOrMemberExpression()
killedBy: expression contextual hello = "World !"
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] ObjectLiteral
punyexpr.js:436:76
       }
     }
 
-    const exponentiationExpression = _recursiveExpression(unaryExpression, {
-      '**': exp
-    })
+    const exponentiationExpression = _recursiveExpression(unaryExpression, {})
 
     const multiplicativeExpression = _recursiveExpression(exponentiationExpression, {
killedBy: expression basic 10 ** 2 = 100
statusReason: UnexpectedTokenError: Unexpected token @4

[Killed] ConditionalExpression
punyexpr.js:479:13
       if (shiftOnSymbols(['?'])) {
         const trueResult = conditionalExpression()
         checkNotEndOfExpression()
-        if (!isSymbol(':')) {
+        if (true) {
           unexpected()
         }
killedBy: expression ternary true ? 1 : 2 = 1
statusReason: UnexpectedTokenError: Unexpected token @9

[Killed] ConditionalExpression
punyexpr.js:495:11
     return (...args) => {
       [tokens, options] = args
       const result = expression()
-      if (tokens.length !== 0) {
+      if (true) {
         PunyExprError.throw('UnexpectedRemainderError', `Unexpected left over tokens @${offset()}`, offset())
       }
killedBy: expression builds a function
statusReason: EndOfExpressionError: Unexpected end of expression

[Killed] BlockStatement
punyexpr.js:517:26
     )
   }
 
-  const toJSON = expr => {
-    const [op, args, [at, length]] = expr[OP_DETAILS]
-    const filtered = {}
-    return {
-      op,
-      at,
-      length,
-      args: args
-        .map(arg => {
-          // eslint-disable-next-line valid-typeof
-          if (typeof arg === FUNCTION) {
-            if (arg[OP_DETAILS]) {
-              return toJSON(arg)
-            }
-            return filtered
-          }
-          if (Array.isArray(arg)) {
-            return arg.map(toJSON)
-          }
-          return arg
-        })
-        .filter(arg => arg !== filtered)
-    }
-  }
+  const toJSON = expr => {}
 
   const punyexpr = (str, options = {}) => {
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"args": [1], "at": 0, "length": 1, "op": "constant"}
Received: undefined

[Killed] ObjectLiteral
punyexpr.js:520:12
   const toJSON = expr => {
     const [op, args, [at, length]] = expr[OP_DETAILS]
     const filtered = {}
-    return {
-      op,
-      at,
-      length,
-      args: args
-        .map(arg => {
-          // eslint-disable-next-line valid-typeof
-          if (typeof arg === FUNCTION) {
-            if (arg[OP_DETAILS]) {
-              return toJSON(arg)
-            }
-            return filtered
-          }
-          if (Array.isArray(arg)) {
-            return arg.map(toJSON)
-          }
-          return arg
-        })
-        .filter(arg => arg !== filtered)
-    }
+    return {}
   }
 
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "args": Array [
-     1,

[Killed] MethodExpression
punyexpr.js:524:13
       op,
       at,
       length,
-      args: args
-        .map(arg => {
-          // eslint-disable-next-line valid-typeof
-          if (typeof arg === FUNCTION) {
-            if (arg[OP_DETAILS]) {
-              return toJSON(arg)
-            }
-            return filtered
-          }
-          if (Array.isArray(arg)) {
-            return arg.map(toJSON)
-          }
-          return arg
-        })
-        .filter(arg => arg !== filtered)
+      args: args.map(arg => {
+  // eslint-disable-next-line valid-typeof
+  if (typeof arg === FUNCTION) {
+    if (arg[OP_DETAILS]) {
+      return toJSON(arg);
+    }
+    return filtered;
+  }
+  if (Array.isArray(arg)) {
+    return arg.map(toJSON);
+  }
+  return arg;
+})
     }
   }
killedBy: expression regex when allowed /abc/ = {}
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
    "args": Array [
      "abc",
