[Killed] BlockStatement
punyexpr.js:525:21
       at,
       length,
       args: args
-        .map(arg => {
-          // eslint-disable-next-line valid-typeof
-          if (typeof arg === FUNCTION) {
-            if (arg[OP_DETAILS]) {
-              return toJSON(arg)
-            }
-            return filtered
-          }
-          if (Array.isArray(arg)) {
-            return arg.map(toJSON)
-          }
-          return arg
-        })
+        .map(arg => {})
         .filter(arg => arg !== filtered)
     }
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "args": Array [
-     1,

[Killed] BlockStatement
punyexpr.js:527:40
       args: args
         .map(arg => {
           // eslint-disable-next-line valid-typeof
-          if (typeof arg === FUNCTION) {
-            if (arg[OP_DETAILS]) {
-              return toJSON(arg)
-            }
-            return filtered
-          }
+          if (typeof arg === FUNCTION) {}
           if (Array.isArray(arg)) {
             return arg.map(toJSON)
killedBy: expression basic 1 + 2 = 3
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 16
+ Received  +  2

  Object {
    "args": Array [
-     Object {

[Killed] ConditionalExpression
punyexpr.js:528:17
         .map(arg => {
           // eslint-disable-next-line valid-typeof
           if (typeof arg === FUNCTION) {
-            if (arg[OP_DETAILS]) {
+            if (true) {
               return toJSON(arg)
             }
killedBy: expression regex when allowed /abc/ = {}
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
punyexpr.js:528:17
         .map(arg => {
           // eslint-disable-next-line valid-typeof
           if (typeof arg === FUNCTION) {
-            if (arg[OP_DETAILS]) {
+            if (false) {
               return toJSON(arg)
             }
killedBy: expression basic 1 + 2 = 3
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 18
+ Received  +  1

  Object {
-   "args": Array [
-     Object {

[Killed] ConditionalExpression
punyexpr.js:533:15
             }
             return filtered
           }
-          if (Array.isArray(arg)) {
+          if (false) {
             return arg.map(toJSON)
           }
killedBy: expression basic (2).toFixed(2) = "2.00"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

@@ -22,18 +22,11 @@
        "at": 0,
        "length": 11,

[Killed] ConditionalExpression
punyexpr.js:538:24
           }
           return arg
         })
-        .filter(arg => arg !== filtered)
+        .filter(arg => false)
     }
   }
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
-   "args": Array [
-     1,

[Killed] EqualityOperator
punyexpr.js:538:24
           }
           return arg
         })
-        .filter(arg => arg !== filtered)
+        .filter(arg => arg === filtered)
     }
   }
killedBy: expression basic 1 = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
-   "args": Array [
-     1,

[Killed] ObjectLiteral
punyexpr.js:543:39
   }
 
   const punyexpr = (str, options = {}) => {
-    const impl = parse(tokenize(str), {
-      regex: false,
-      ...options
-    })
+    const impl = parse(tokenize(str), {})
     const expr = (context = {}) => impl(context)
     assignROProperties(expr, {
killedBy: expression regex when allowed /abc/ = {}
statusReason: RegExpDisabledError: Regular expressions are disabled @0
